{"saves":[{"kind":"t1","subreddit":"InternetIsBeautiful","text":"You can install an open source plugin called [LibRedirect](https://github.com/tillcash/libredirect). It automatically redirects some sites to alternative open source frontends including\n* YouTube → Piped, Invidious, FreeTube, Yattee\n* Twitter → Nitter \n* Instagram → Bibliogram\n* TikTok → ProxiTok\n* Reddit → LibReddit, Teddit  \n\nAnd others. You can also disable redirects if you don't want one of them. (For instance I found the Wikipedia redirects to load awfully slow **and** I have basic trust Wikipedia)","link":"https://www.reddit.com/r/InternetIsBeautiful/comments/t44z8f/if_twittercom_is_replaced_with_nitternet_in_links/hywixc9/","name":"t1_hywixc9","ups":2564,"author":"Elemnut","created":"2022-03-01"},{"kind":"t3","subreddit":"InternetIsBeautiful","text":"If \"twitter.com\" is replaced with \"nitter.net\" in links, you can read without login constraints","link":"https://www.reddit.com/r/InternetIsBeautiful/comments/t44z8f/if_twittercom_is_replaced_with_nitternet_in_links/","name":"t3_t44z8f","ups":30816,"author":"Wolfframm","created":"2022-03-01"},{"kind":"t3","subreddit":"Infographics","text":"32 of the most bizarre deep-sea creatures discovered so far","link":"https://www.reddit.com/r/Infographics/comments/t3mlv9/32_of_the_most_bizarre_deepsea_creatures/","name":"t3_t3mlv9","ups":509,"author":"giuliomagnifico","created":"2022-02-28"},{"kind":"t1","subreddit":"LifeProTips","text":"I used to get this too until a physiotherapist taught me what I was doing wrong. He told me to inhale and then, instead of forcefully exhaling like I was doing, to just let the air slowly seep out. If you relax while full of air, your lungs naturally deflate. He said a forceful exhale will just prolong the hyperventilation because you’re still adding tension to your diaphragm and muscles, which causes that air hunger/suffocating feeling. He demonstrated this by showing that his exhales were silent, while mine were quite loud (just like every single self proclaimed breathing expert on the internet I had turned to in my misery).\n\nJust like that a professional ended a decade of chronic hyperventilation and tight chest and back muscles. All it took was listening to someone who knows what they’re doing and 10 minutes of breathing right.\n\nEDIT: Since this comment is getting some attention, a lot of people must be suffering from this, so I’ll add another bit of info he gave me. If you first start breathing like this you might experience a sort of stuttering or spasms/resistance in you diaphragm while exhaling, that means you need it. This is because your body is not used to letting go of tension there so it kind of wants to hold it. This gets better as you do it more often.\n\nAnother thing he told me that really helped me was to let my arms and shoulders hang down when standing up or let them sink in the mattress when lying down, I habitually used to keep them high, which pulled up on my diaphragm and impaired my breathing.","link":"https://www.reddit.com/r/LifeProTips/comments/t3xbdo/lpt_if_youre_in_a_hurry_and_something_goes_wrong/hyvzfxc/","name":"t1_hyvzfxc","ups":1222,"author":"_applemoose","created":"2022-03-01"},{"kind":"t1","subreddit":"explainlikeimfive","text":"Horses and donkeys have a different number of chromosomes. Specifically, horses have 64 chromosomes and donkeys have 62. During sexual reproduction the chromosomes are split in half and the offspring gets one half from each parent to make the full set. So, the horse donates 32 chromosomes and the donkey donates 31.\n\nThat means the mule has 63.You may notice that 63 is an odd number. The genes in the chromosomes are similar *enough* that as they get activated they can still create a functional animal. When the mule tries to reproduce, its reproductive cells try to split the chromosomes in half and fail to do it evenly. When the reproductive cells combine, the chromosomes *can't* match up correctly because of the odd numbered split. Without matching correctly, they can't be activated correctly and the offspring will fail to develop.\n\nEDIT: Fun side fact, this is how seedless watermelon work, with some extra steps. One watermelon is treated with a chemical that causes all of the chromosomes to double. Then, pollen from that watermelon is used to pollinate a normal watermelon. So a normal watermelon would have ZZ chromosomes, and reproductive cells with Z; the treated watermelon has ZZZZ, and reproductive cells with ZZ. When you combine the reproductive cells of both, you get a watermelon with ZZZ - an odd number, and incapable of reproducing. The seeds that this watermelon makes are a hodgepodge of chromosomes and do not fully develop.\n\nFun side fact #2: camels and llamas have the same number of chromosomes. Despite being different species that evolved apart for millions of years on different continents, they are still similar enough to have hybrid offspring like horses and donkeys. However, since camels and llamas have the same number of chromosomes, their offspring can themselves have viable offspring.\n\nFun side fact #3: hybrids are normally named with the first letter of the father animal and the rest of the name of the mother animal. Thus, a *liger* is a hybrid between a male lion and female tiger. Mules don't follow this rule, AFAIK because humans have been breeding mules for about as long as we've been domesticating horses and donkeys. A mule is the offspring of a male donkey and female horse (which could also be called a \"dorse\" but that sounds dumb). Offspring from a male horse and female donkey is called a \"hinny\" (a female donkey is called a Jenny) and they are apparently pretty different from mules. Mules are a lot easier to breed.\n\nEdit: **Why does the odd number make reproduction (usually) impossible?**\n\nImagine DNA as an instruction book with pages (genes) organized into chapters (chromosomes). Every book has two copies of every chapter. They're *mostly* identical, but with very small changes. Maybe different size screws or more screws or whatever. To reproduce, the chapters are separated, and then pages are swapped between two different books so that now you get a chapter that says to use fewer screws, but also bigger screws. Build the thing and see if it works better.\n\nFor that to work, the two books have to be very close. Like, you could use instructions for two kinds of tables, but not a table and a bookshelf. \n\nIf they're *almost* close enough, like a table and a computer desk, you can mix the instructions and they'll still work and you get something that's kind of like both. But if you take *that* book and try to split up the chapters you get an odd number of pages. When you try to mix them back together it throws off the page numbers. The new books you try to make end up with important pages missing, or extra pages that add, like, an extra leg that has nowhere to go.\n\nThe builder is pretty simple and follows the basic knowledge that all instructions have duplicate pages, so they have to use one out of every two. They don't have to always skip the odd number or even number, but they can only use one or the other for every two pages. Throw in an entire chapter of extra pages, though, and it completely throws off which pages the builder can use. Since it becomes very obvious that it isn't going to work pretty early on, the builder will give up pretty quickly.\n\nEdit: **What about chromosome disorders in humans, like Down's Syndrome?**\n\nYes, Down's Syndrome, caused by trisomy 21 (three chromosomes at #21) causes fertility problems, with women being fertile about 15-30% of the time. Their offspring have a high chance (~50%) of also having trisomy 21.\n\nMen with Down's Syndrome appear to be far less fertile, but it's been documented a couple times AFAIK. Some research suggests that the apparent low fertility may come from ignorance of sex itself, rather than necessarily the inability to produce viable sperm. That is, they just don't have sex often so they don't father children very often.\n\nI haven't looked up stats for other chromosome disorders, but most of them can't develop enough to be born or aren't capable of life after birth so it's mostly moot. When it does happen, I'm sure there are fertility issues there. \n\nKeep in mind that humans reproducing with chromosomal disorders are still both humans so reproduction is already the expected result. It's already genetically much easier. Horses and donkeys (and other hybrid species) are related but *not* the same species so reproduction is already *not* genetically guaranteed.","link":"https://www.reddit.com/r/explainlikeimfive/comments/t3ued1/eli5_why_are_mules_infertile_if_a_horse_and_a/hyuots4/","name":"t1_hyuots4","ups":12466,"author":"RhynoD","created":"2022-03-01"},{"kind":"t3","subreddit":"me_irl","text":"Me_irl","link":"https://www.reddit.com/r/me_irl/comments/t2ndps/me_irl/","name":"t3_t2ndps","ups":52789,"author":"waqasnaseem07","created":"2022-02-27"},{"kind":"t1","subreddit":"me_irl","text":"I hate how huge file sizes are now. No one even tries to compress or optimize anything anymore. I blame call of duty for getting that train started. Once companies saw that consumers will buy it anyway they stopped putting effort into making file sizes smaller.","link":"https://www.reddit.com/r/me_irl/comments/t2ndps/me_irl/hynn3gw/","name":"t1_hynn3gw","ups":226,"author":"TossYourCoinToMe","created":"2022-02-27"},{"kind":"t3","subreddit":"privacy","text":"Secret facial recognition: Texas wants to sue Meta into bankruptcy","link":"https://www.reddit.com/r/privacy/comments/t2pe6g/secret_facial_recognition_texas_wants_to_sue_meta/","name":"t3_t2pe6g","ups":3494,"author":"bobbyw24","created":"2022-02-27"},{"kind":"t3","subreddit":"privacy","text":"Ukrainians turned to encrypted messaging app Signal as Russians invaded","link":"https://www.reddit.com/r/privacy/comments/t1k1hn/ukrainians_turned_to_encrypted_messaging_app/","name":"t3_t1k1hn","ups":4001,"author":"sighcf","created":"2022-02-26"},{"kind":"t1","subreddit":"learnprogramming","text":"It's frustrating because people (especially programmers) underestimate it, and they try to get things done without putting any effort into learning all the mechanics involved.\n\nIf you put in that effort and spend some time learning things, and just get experience through time, CSS will stop being in any way an obstacle for you. But I will agree that the initial learning curve is very annoying. This is somewhat remedied by flexbox, which makes things much more intuitive. But it's still important to know the older tools, if for nothing else than supporting older browsers. It doesn't have ideal support yet. And it's not appropriate for every situation, so you still want to know the other layout methods.\n\nWhat I can tell you is that you should research the differences between display:block/inline/inline-block, and position relative/static/fixed/absolute, and how those two properties interact with each other and other things, like margins, z-index, left/top/right/bottom. Also, make sure you understand what the implications of floats are, how to clear floats, and when vertical-align works. \n\nA couple of gotchas:\n\n- Setting the horizontal margins to auto means it tries to give as much margin on either side as possible, resulting in the container centering itself. But that only works for `display: block`, if that block element has a set width. For inline block, it's not gonna do much and you should give the parent `text-align: center`.\n\n- `float: left` and `float: right` weren't really intended for layouts, so they have some weird interactions - namely, if all your children are floated, then the paren't will not have a height, so you need to clear that (google clearfix). Also, you can't use vertical-align: middle for floated elements.\n\n- `vertical-align: middle` centers inline-block items relative to each other. It doesn't put the items to the center of their container. Think of it as selecting some layers in Photoshop and going Layer - Align - Vertical Centers. The exception to this is if your parent is `display: table` - in that case `vertical-align: middle` will actually center your thing in the middle of it's parent. \n\n- `position: absolute` isn't always relative to the document, it's relative to the first parent that has `position: relative` set. If none are present, it's relative to the document. \n\n- Inline-block renders whitespace. Typically, your markup will have spaces between elements, so if you put a bunch of inline-block items next to each other, there'll be one space's worth of whitespace between them. As such, you can't reliably make a grid by just setting width: 50% for two inline-block elements. You can remedy this by setting `font-size: 0` on the parent so that the whitespace isn't rendered. Or just go for floats. Or flexbox.","link":"https://www.reddit.com/r/learnprogramming/comments/43fral/why_is_css_so_frustrating/czhvohq/","name":"t1_czhvohq","ups":16,"author":"[deleted]","created":"2016-01-30"},{"kind":"t1","subreddit":"explainlikeimfive","text":"It does get clogged.\n\nIt's not a free for all where the phones just transmit whenever they want. The cell phone system controls the phones and tells them when it's ok for them to transmit and when not to transmit. It does this based on need so that phones not using a lot of data get less time. This means it's not always obvious how busy the system is. But this sharing system has its limits,  if there are lots of phones all trying to use the network at once then everyones connection slows down.\n\nIn really heavily loaded situation connections will drop out. The system tries to do this in a smart way so that data fails first allowing voice calls to still go through. And if there are too many phone calls emergency calls get priority over normal calls.\n\n\nEdit: getting a little over 5 year old level here but there are several ways to share radio time. A lot of people are talking about each phone talking at a different time (TDMA, time division multiple access). Some are talking about different frequencies (FDMA). And there is also CDMA, code division multiple access, where the signals are encoded in a way to allow them to be separated out at the receiver. \n\nCell phone systems initially used either TDMA or CDMA depending on the type of network. The newer standards are horrendously complicated and use a combination of these simultaneously.","link":"https://www.reddit.com/r/explainlikeimfive/comments/t0j8gi/eli5_how_do_they_make_it_so_you_can_have/hyaapgm/","name":"t1_hyaapgm","ups":2455,"author":"willingly-ignorant","created":"2022-02-24"},{"kind":"t1","subreddit":"goodanimemes","text":"Your social credit system (社会信用体系) score has been deducted\n\n# **FAQ**\n\n## What does this mean?\nYour social credit rating (out of 8) on the now fully-functioning social credit system has been reduced. \n\n## Why did you do this?\nThere are several reasons your social credit score may have been reduced. You may have shown extremist tendencies such as having a sense of humour, voicing your own opinions and objecting to ~~xinnie the Pooh’s~~ our great comrade and leader Xi Jinping’s rule and corruption, showing a visible lack of ~~brainwashing~~ education which could demonstrate a lack of loyalty to the sublime party &amp; make you more vulnerable to western lies &amp; propaganda such as the Uyghur genocide &amp; the Hong Kong protests, alongside regular conspiracies such as “Taiwan”? Plus many other reasons for the party to harbour potential worries about your loyalty to this brilliant nation. \n\n## Am I banned from the one and only China?\nNo - not yet. But you should refrain from making comments like this in the future. Otherwise I, this AI produced in part by Huawei, Ant group and Alibaba group in coordination with the Chinese government, will be forced to issue an additional social credit score deduction, which may put your commenting on all Chinese-monitored social media platforms and posting privileges in jeopardy. Should this continue, your social credit score will limit your social capabilities from being able to purchase public transport to being able to leave your own home, and soon enough you may magically disappear. \n\n## I don’t believe I deserve a social credit reduction. Can this be reversed?\nNo. A computer only does what you tell it to do. And Alibaba, Huawei and the Chinese government as well as Ant group have decided to program the algorithm for the social credit system to work exactly as it has done. In fact this demonstrates how uneducated and trustless you are that you are doubting the party itself. Your score will be reduced even more instead.\n\n## How can I prevent this from happening in the future?\nAccept the reduction and move on. But learn from this mistake: your behavior will not be tolerated by the wan and only China. We will continue to issue score reductions until you improve your conduct. Remember: Chinese spyware  is **privilege**, not a **right**.","link":"https://www.reddit.com/r/goodanimemes/comments/t05bn3/salute_to_our_fallen_vtuber_waifu/hy8g3vz/","name":"t1_hy8g3vz","ups":5,"author":"PrankToReap","created":"2022-02-24"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Encrypted and Anonymous DNS via custom DNScrypt-proxy setup vs Cloudflare DNS","link":"https://www.reddit.com/r/PrivacyGuides/comments/szr47i/encrypted_and_anonymous_dns_via_custom/","name":"t3_szr47i","ups":43,"author":"PVDF_4830","created":"2022-02-23"},{"kind":"t3","subreddit":"coolguides","text":"The mood meter","link":"https://www.reddit.com/r/coolguides/comments/symuji/the_mood_meter/","name":"t3_symuji","ups":23315,"author":"regian24","created":"2022-02-22"},{"kind":"t3","subreddit":"Infographics","text":"What we see when we look into the sky","link":"https://www.reddit.com/r/Infographics/comments/sy1k7d/what_we_see_when_we_look_into_the_sky/","name":"t3_sy1k7d","ups":534,"author":"wwqt","created":"2022-02-21"},{"kind":"t3","subreddit":"privacy","text":"TikTok Can Circumvent Apple and Google Privacy Protections and Access Full User Data, 2 Studies Say (Exclusive)","link":"https://www.reddit.com/r/privacy/comments/sy21yv/tiktok_can_circumvent_apple_and_google_privacy/","name":"t3_sy21yv","ups":2604,"author":"SillyCubensis","created":"2022-02-21"},{"kind":"t3","subreddit":"anime","text":"Demon Slayer Season 2 Penultimate Episode Beats Beijing Winter Olympics in viewership. Scores a record high of 17.7 Million Viewers.","link":"https://www.reddit.com/r/anime/comments/swgvnu/demon_slayer_season_2_penultimate_episode_beats/","name":"t3_swgvnu","ups":3296,"author":"no_longer_huhmann","created":"2022-02-19"},{"kind":"t3","subreddit":"privacy","text":"Cookies: I looked at 50 well-known websites and most are gathering our data illegally","link":"https://www.reddit.com/r/privacy/comments/svl8pj/cookies_i_looked_at_50_wellknown_websites_and/","name":"t3_svl8pj","ups":1417,"author":"LisaMck041","created":"2022-02-18"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Covid testing firm ‘selling swabs carrying customers’ DNA’ to third parties","link":"https://www.reddit.com/r/PrivacyGuides/comments/sw2xgi/covid_testing_firm_selling_swabs_carrying/","name":"t3_sw2xgi","ups":258,"author":"para_lyzed","created":"2022-02-19"},{"kind":"t3","subreddit":"privacy","text":"6 Things We Know about the CIA’s Secret Mass Surveillance Program","link":"https://www.reddit.com/r/privacy/comments/sviinv/6_things_we_know_about_the_cias_secret_mass/","name":"t3_sviinv","ups":330,"author":"w650az","created":"2022-02-18"},{"kind":"t1","subreddit":"explainlikeimfive","text":"One and the same, and it's not usually a volcano. Usually it's a deep fissure that might reach the mantle. As water flows down, pressures increase, preventing the water from boiling as Temps increase (boiling point is dependant on pressure). So you have all this super heated water far underground that is dissolving the surrounding minerals, creating a mineral rich solution. Sometimes this hot, mineral rich solution makes its way to the surface (sort of like placing a drop of food coloring in water, how it eventually gets everywhere) resulting in highly-mineralized water at the surface but remember pressure and temperature will drop as we get back to the surface as well, allowing the minerals to fall out of suspension and deposit onto surrounding land/rock. That's why you often see these crazy mineral formations at hot springs.\n\nNow, you can also have a situation where this mineralized water deep underground can flash into steam from the high heat. In this case you can have a geyser where the expanding steam forces the water upward and out of the ground with such force it creates a fountain. You'll also see crazy mineral deposits around these geysers.\n\nThese events are also what lead to veins in rock. Think of granite cliffs like at Yosemite for example. You can sometimes see veins of quartz running through the rock. These were made a long time ago when the mountain was deep underground, and big cracks developed in the granite from the immense heat and pressure present deep underground. Water then made its way down those cracks and did the same thing I described above, carrying mineral back up the crack, either in liquid water or sometimes big bursts of hot steam. The minerals (like quartz and others) are deposited along the sides of the crack and slowly build up layer after layer until the crack is mostly filled back in with these new minerals.\n\nThen, millions of years later, that rock is pushed upward from deep in the earth, often from plate tectonics or volcanic activity, and gets pushed up into a mountain.\n\nMore millions of years and the mountain erodes and breaks apart until today we can see this exposed rock and view the veins of quartz and other minerals that were created deep, deep underground millions of years ago.\n\nThis process is how a lot of gold comes to be found on the surface of the earth. If you own anything made of gold, it likely made its way to your hand through this process that took millions and millions of years.\n\nI think that's pretty damn cool. \n\nI'm not a geologist, but I enjoy the subject. I'd welcome any experts to correct me or elaborate where appropriate.","link":"https://www.reddit.com/r/explainlikeimfive/comments/svhk8x/eli5_how_do_hot_springs_exist_in_cold_mountain/hxgzfiw/","name":"t1_hxgzfiw","ups":1621,"author":"tiedyemike8","created":"2022-02-18"},{"kind":"t3","subreddit":"PrivacyGuides","text":"'Smart homes' and privacy","link":"https://www.reddit.com/r/PrivacyGuides/comments/suwboh/smart_homes_and_privacy/","name":"t3_suwboh","ups":29,"author":"Green-Tesseract","created":"2022-02-17"},{"kind":"t3","subreddit":"Infographics","text":"Travel Etiquette Around The World","link":"https://www.reddit.com/r/Infographics/comments/suleo9/travel_etiquette_around_the_world/","name":"t3_suleo9","ups":843,"author":"James_Korbyn","created":"2022-02-17"},{"kind":"t3","subreddit":"goodanimemes","text":"Nintendo Switch-Chan’s Lawyers","link":"https://www.reddit.com/r/goodanimemes/comments/stcq1t/nintendo_switchchans_lawyers/","name":"t3_stcq1t","ups":6873,"author":"Merryweatherey","created":"2022-02-15"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Should i use Protonmail for login on other websites?","link":"https://www.reddit.com/r/PrivacyGuides/comments/sunydk/should_i_use_protonmail_for_login_on_other/","name":"t3_sunydk","ups":4,"author":"GuN4iK","created":"2022-02-17"},{"kind":"t1","subreddit":"animepiracy","text":"Hosting an illegal site was never easy, and I never said it was easy. But there are easy things you can do which give you a lot more security. Some examples would be not using your real name and address, not using your real credit card for the server payments, using crypto for your payments, getting a domain that has been known to be somewhat resistant to DMCAs, not posting the fricking source code on a public site like GitHub, not using your real email and so on. \n\nWhat I listed are things that are not so hard to do, hell it's easier than setting up a website. Will they make you 100% immune to DMCA ? No, but they will make you a lot safer from DMCA. If funimation's got nothing on you, whatever letters they send you, will be empty threats.","link":"https://www.reddit.com/r/animepiracy/comments/st7n0t/another_one_bites_the_dust_just_the_usual_cease/hx2qf9x/","name":"t1_hx2qf9x","ups":27,"author":"Basic_Requirement561","created":"2022-02-15"},{"kind":"t1","subreddit":"animepiracy","text":"Honestly, use a no-log VPN. Have a front-end hosted in Switzerland while having the files in a remote server that is not connected to you. Have encrypted traffic between the two, preferably even have another proxy in between. For seasonal stuff you can just set up a RSS fetcher to always download new SubsPlease stuff etc.\n\nThis does not come from experience ;)","link":"https://www.reddit.com/r/animepiracy/comments/st7n0t/another_one_bites_the_dust_just_the_usual_cease/hx2r9ns/","name":"t1_hx2r9ns","ups":65,"author":"ViktorVaughnLickupon","created":"2022-02-15"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Government launches “No Place To Hide” propaganda campaign to ban online privacy","link":"https://www.reddit.com/r/PrivacyGuides/comments/ssg57k/government_launches_no_place_to_hide_propaganda/","name":"t3_ssg57k","ups":276,"author":"daninthetoilet","created":"2022-02-14"},{"kind":"t3","subreddit":"animepiracy","text":"MS Paint Anime Torrent Flowchart","link":"https://www.reddit.com/r/animepiracy/comments/ss3tga/ms_paint_anime_torrent_flowchart/","name":"t3_ss3tga","ups":870,"author":"Arcus_Deer","created":"2022-02-14"},{"kind":"t1","subreddit":"PrivacyGuides","text":"It's working fine. Cryptomator is the right choice, whatever your cloud storage is.\n\nJust another comment: with Cryptomator, your cryted files will be see as a huge amount of files and folders with long names.  OneDrive will consider these may be a result of a Ransomware and will warn you. You will have to confirm everything's fine","link":"https://www.reddit.com/r/PrivacyGuides/comments/ss5bft/if_we_heavily_encrypt_all_the_files_with/hww7jub/","name":"t1_hww7jub","ups":23,"author":"Darth_Nagar","created":"2022-02-14"},{"kind":"t3","subreddit":"Piracy","text":"ProtonsMail shared the IP address of activists with law enforcement authorities, leading to their arrests.","link":"https://www.reddit.com/r/Piracy/comments/pj2rji/protonsmail_shared_the_ip_address_of_activists/","name":"t3_pj2rji","ups":1350,"author":"BootywReckR","created":"2021-09-06"},{"kind":"t3","subreddit":"Piracy","text":"8 Tips to make sure you are secure with your VPN","link":"https://www.reddit.com/r/Piracy/comments/p7fmdw/8_tips_to_make_sure_you_are_secure_with_your_vpn/","name":"t3_p7fmdw","ups":1059,"author":"clara59000","created":"2021-08-19"},{"kind":"t3","subreddit":"coolguides","text":"How to \"jump\" your car battery the right way.","link":"https://www.reddit.com/r/coolguides/comments/snpd77/how_to_jump_your_car_battery_the_right_way/","name":"t3_snpd77","ups":31805,"author":"I_feeel_different","created":"2022-02-08"},{"kind":"t1","subreddit":"ISO8601","text":"It wasn't always available: https://caniuse.com/mdn-javascript_builtins_date_toisostring\n\nBut like the other commentor said, it's definitely not ideal for all users and you don't often want to ask users to convert timezones in their head.\n\nThe output of `(new Date()).toISOString()` is exactly what should be used nearly 100% of the time when serializing dates for JSON or API calls.\n\nIn an ideal world the user will have configured their operating system with the regional settings and date formats of their choosing (possibly even ISO 8601 compatible dates). Then the JS developer can use the [`Intl.DateTimeFormat`](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Intl/DateTimeFormat) API to display dates/times exactly as the user wishes.","link":"https://www.reddit.com/r/ISO8601/comments/snox83/javascript_has_a_built_in_to_iso_date_string/hw3wcju/","name":"t1_hw3wcju","ups":42,"author":"ijmacd","created":"2022-02-08"},{"kind":"t1","subreddit":"PrivacyGuides","text":"Copy the article link &gt; go to archive.is &gt; paste the link and press save \n\nYou will be able to bypass paywalls this way. For this article you can read it here: https://archive.is/YQ4hz","link":"https://www.reddit.com/r/PrivacyGuides/comments/so38gb/were_fine_without_facebook_german_and_french/hw7mmu6/","name":"t1_hw7mmu6","ups":9,"author":"BrexitBlaze","created":"2022-02-09"},{"kind":"t3","subreddit":"coolguides","text":"Flexibility of the f word","link":"https://www.reddit.com/r/coolguides/comments/sna36c/flexibility_of_the_f_word/","name":"t3_sna36c","ups":3588,"author":"landekeshav5","created":"2022-02-08"},{"kind":"t3","subreddit":"privacy","text":"We’re Fine Without Facebook, German and French Ministers Say","link":"https://www.reddit.com/r/privacy/comments/sn0v4m/were_fine_without_facebook_german_and_french/","name":"t3_sn0v4m","ups":5254,"author":"linuxuser789","created":"2022-02-07"},{"kind":"t3","subreddit":"dataisbeautiful","text":"[OC] Most Popular Programming Languages in Public GitHub Repos","link":"https://www.reddit.com/r/dataisbeautiful/comments/sm1zka/oc_most_popular_programming_languages_in_public/","name":"t3_sm1zka","ups":3601,"author":"PieChartPirate","created":"2022-02-06"},{"kind":"t1","subreddit":"PrivacyGuides","text":"Let me explain a few things first.\n\n1. Your router likely isn't tracking your URL connections, and even if it were, it's your ISP you have to worry about anyway. There is no reason to grab data from your router when your ISP tracks far more, and actively monitors all your activity.\n\n2. Mac address can't be accessed by websites, only priviledged software can grab it. Thus a randomized MAC address has no benefit for stopping website tracking and fingerprinting.\n\n3. Unless you use a public router, it wouldn't matter if you randomized your MAC address, your ISP would still connect it to you. Besides, fingerprinting can achieve the same result without MAC addresses even on a public network.\n\n4. The amount of money and resources that would need to be invested into connecting your Tor activity to your router would be abysmal. There are better and easier ways to track you, and again, MAC randomization doesn't protect you there anyway.\n\nA better solution would be to obfuscate your IP by using an encrypted tunnel to another server, *then* using Tor through that connection. Unfortunately, I can't be more specific than that without the comment being removed via automod due to a rule on this subreddit about a specific commercial product.\n\nUsing Tor through this method means that the entry node cannot see your true IP, and as such it does not matter if it is compromised so long as the server you connect to through said encrypted tunnel does not keep logs. All your ISP would see is encrypted traffic sent to a server, and there would be many active users on that server at any given time that would obfuscate your identity. Your ISP wouldn't even know you were accessing Tor.\n\nPersonally, I use said encrypted tunnel regardless of whether or not I am using Tor, and I *do not* use the built-in option for the server I connect to that routes my traffic through Tor. It's better to use a normal server and use the Tor browser with it. Also, use the default DNS your encrypted tunnel provider uses; don't change it. Changing your DNS would make you much easier to track.\n\nRealistically, it isn't hard to randomize your MAC address in Linux or MacOS (in fact, it's trivial), but I have no idea about Windows. There are many guides on how to do this on Linux, so I won't get into it here; you can search that easily yourself. It won't provide you any realistic benefit when you're using your own WiFi, but if it makes you feel safer, go ahead and do it. *Encrypting your router logs* would be useless even if you could find a way to do it, so don't bother. Just turn URL logging off if it's turned on.","link":"https://www.reddit.com/r/PrivacyGuides/comments/smao9n/randomizing_my_mac_address/hvvvfb3/","name":"t1_hvvvfb3","ups":32,"author":"para_lyzed","created":"2022-02-07"},{"kind":"t3","subreddit":"privacy","text":"[Deja Vu] Facebook Says it Will Stop Operating in Europe If Regulators Don’t Back Down","link":"https://www.reddit.com/r/privacy/comments/slxuam/deja_vu_facebook_says_it_will_stop_operating_in/","name":"t3_slxuam","ups":673,"author":"lemon_bottle","created":"2022-02-06"},{"kind":"t1","subreddit":"me_irl","text":"I don't know how much math knowledge you have, but I'll try to break it down.\n\nA derivative tells you how one thing changes with another thing. If you have a line on a position (m) versus time (s) graph, the derivative is the slope of that line, which gives you velocity (m/s). You can do this with anything, like temperature and pressure.\n\nA partial derivative means that there are multiple variables. The best way to think about this is imagining that you're standing on a tightrope. In front and behind of you (lets call that y), everything is flat. On the left and right of you (lets call that x), is a steep fall. In this case, dz/dy, or how z changes with y is 0. If you walk forward or backwards, your elevation doesn't change. dz/dx would be this large negative number because moving side to side would greatly decrease your elevation (z). \n\nAn integral gives you the area under a curve in a graph. You can multiply multiple integrals together to give more dimensions. In case of a triple spherical integral, this is a scary way of saying that you're getting the volume of a sphere. One integral deals with the area of the radius, or how wide your sphere is. The other two deal with the vertical angle and the horizontal angle.\n\nFor a simple example, lets say you want to find the area of a 2 by 2 square, you multiply length and height, which would give you 4 square units. The calculus way of doing this is integrating y=2 from 0 to 2. This gives 2(2)-2(0) which is 4 square units. Basically, you have a line at a height of 2 units and you're saying that you want the area between point x=0 and x=2. This can be scaled up to higher dimensions like 3-D and beyond, and it can be done in polar so that its cleaner for circular/spherical shapes.","link":"https://www.reddit.com/r/me_irl/comments/sl5xhq/me_irl/hvr8wgn/","name":"t1_hvr8wgn","ups":16,"author":"Rambo7112","created":"2022-02-05"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Qubes OS 4.1.0 has been released!","link":"https://www.reddit.com/r/PrivacyGuides/comments/slm2lv/qubes_os_410_has_been_released/","name":"t3_slm2lv","ups":85,"author":"Tommy_Tran","created":"2022-02-06"},{"kind":"t3","subreddit":"PrivacyGuides","text":"NordVPN quietly changes 2017 blog post to say that they do comply with law enforcement request and that they can and will track you with a legal law enforcement request","link":"https://www.reddit.com/r/PrivacyGuides/comments/s8qegc/nordvpn_quietly_changes_2017_blog_post_to_say/","name":"t3_s8qegc","ups":368,"author":"a_Ninja_b0y","created":"2022-01-20"},{"kind":"t3","subreddit":"rfc3339","text":"RFC 3339 vs ISO 8601","link":"https://www.reddit.com/r/rfc3339/comments/ov4fb0/rfc_3339_vs_iso_8601/","name":"t3_ov4fb0","ups":70,"author":"ijmacd","created":"2021-07-31"},{"kind":"t3","subreddit":"news","text":"Wuhan lab staff had Covid-like symptoms before outbreak disclosed, says report","link":"https://www.reddit.com/r/news/comments/njm8o8/wuhan_lab_staff_had_covidlike_symptoms_before/","name":"t3_njm8o8","ups":23449,"author":"Illustrious_Welder94","created":"2021-05-24"},{"kind":"t1","subreddit":"worldnews","text":"You should see the sino-soviet propaganda posters from before the split.\n\nhttps://storiescdn.hornet.com/wp-content/uploads/2020/06/11094202/china-russia.jpg","link":"https://www.reddit.com/r/worldnews/comments/skbiv4/china_joins_russia_in_opposing_nato_expansion/hvk9h52/","name":"t1_hvk9h52","ups":3033,"author":"Captain_Arrrg","created":"2022-02-04"},{"kind":"t3","subreddit":"privacy","text":"Just a quick reminder that if you think Facebook is bad (they are) then you're going to hate TikTok because they're even worse.","link":"https://www.reddit.com/r/privacy/comments/sjvbq6/just_a_quick_reminder_that_if_you_think_facebook/","name":"t3_sjvbq6","ups":1344,"author":"dont_forget_canada","created":"2022-02-03"},{"kind":"t1","subreddit":"cursedcomments","text":"encanto","link":"https://www.reddit.com/r/cursedcomments/comments/sigmlr/cursed_superhearing/hv9g3wa/","name":"t1_hv9g3wa","ups":12,"author":"ziabakugou","created":"2022-02-02"},{"kind":"t3","subreddit":"YouShouldKnow","text":"YSK: You can run Pi-hole and OpenVPN on a server so all of your devices can connect to the internet through it with ads blocked, including Youtube. You don't need a Raspberry Pi.","link":"https://www.reddit.com/r/YouShouldKnow/comments/siimjz/ysk_you_can_run_pihole_and_openvpn_on_a_server_so/","name":"t3_siimjz","ups":2256,"author":"hanoian","created":"2022-02-02"},{"kind":"t3","subreddit":"dataisbeautiful","text":"[OC] Desktop Web Browser Market Share from 1994 to 2021","link":"https://www.reddit.com/r/dataisbeautiful/comments/si1ycd/oc_desktop_web_browser_market_share_from_1994_to/","name":"t3_si1ycd","ups":17714,"author":"PieChartPirate","created":"2022-02-01"},{"kind":"t3","subreddit":"Infographics","text":"[OC] The Most Popular Snack In Each State","link":"https://www.reddit.com/r/Infographics/comments/shzupr/oc_the_most_popular_snack_in_each_state/","name":"t3_shzupr","ups":403,"author":"Dremarious","created":"2022-02-01"},{"kind":"t3","subreddit":"anime","text":"\"Fate/Kaleid Liner Prisma Illya\" Valentine Visual","link":"https://www.reddit.com/r/anime/comments/si2mxm/fatekaleid_liner_prisma_illya_valentine_visual/","name":"t3_si2mxm","ups":4875,"author":"Mazen141","created":"2022-02-01"},{"kind":"t3","subreddit":"privacy","text":"Google to turn on activity tracking for many users who turned it off","link":"https://www.reddit.com/r/privacy/comments/sib4bk/google_to_turn_on_activity_tracking_for_many/","name":"t3_sib4bk","ups":1085,"author":"freakynit","created":"2022-02-02"},{"kind":"t1","subreddit":"Damnthatsinteresting","text":"If there’s one you’ve I’ve learned from watching LockPickingLawyer it’s that you need to stop buying 99% of locks period. \n\nAlso that all locks can eventually be bypassed, so it’s not much of a standalone security feature if there’s real motivation right get in.\n\nWhat they need to do is make the lock inaccessible from the inside lol. There’s a giant plate welded to the door for exactly that reason but not on the cage walls?!\n\nEdit: yeah I know locks aren’t intended to be a panacea, they’re a basic deterrent. I’m just saying a lock that I can open with a belt or by just giving it a sharp rap on the side isn’t a lock that I want to buy. It better at least require some real tools, even just two pliers, not a tiny sliver of an soda can.","link":"https://www.reddit.com/r/Damnthatsinteresting/comments/shukp7/this_dude_demonstrates_how_he_breaks_a_lock/hv4yuau/","name":"t1_hv4yuau","ups":295,"author":"Slggyqo","created":"2022-02-01"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Alternative to Visual studio code / Webstorm","link":"https://www.reddit.com/r/PrivacyGuides/comments/shqr6d/alternative_to_visual_studio_code_webstorm/","name":"t3_shqr6d","ups":1,"author":"Itay8","created":"2022-02-01"},{"kind":"t1","subreddit":"privacy","text":"CSS contains a bunch of rules you can use to make a style only apply if the user's screen/device fulfills certain specifications, such as screen size, device type, whether their browser supports certain css properties (which can be used to determine what browser is being used), and more.\n\nIf you include some form of url import (such as a background-image url that points to a tracking pixel), you can make that url a different unique path for different sets of specifications, and use the list of requests that are actually made to profile the user.\n\nIn complete fairness, Google font stylesheets don't appear to be doing this. But they could if they wanted to.","link":"https://www.reddit.com/r/privacy/comments/sh3oe7/german_court_orders_websites_to_stop_embedding/hv26ou1/","name":"t1_hv26ou1","ups":25,"author":"Quarxnox","created":"2022-01-31"},{"kind":"t1","subreddit":"privacy","text":"Fwiw I always turn my devices off before going through TSA so the drives are encrypted and a code or password is needed to log in. There is case law stating the can force biometrics but not passcode or passwords for logging in.","link":"https://www.reddit.com/r/privacy/comments/sgk4q4/tsa_asked_for_my_phone_during_security_screening/huwti97/","name":"t1_huwti97","ups":1165,"author":"user4839472","created":"2022-01-30"},{"kind":"t1","subreddit":"firefox","text":"To your main question:\n\n1. Click and hold the new tab icon, and select manage containers.\n2. Set up whatever containers you want\n3. Open website in respective container.\n4. Login in that container.\n5. If you always want to simply login to that one account, you can right click on the site, hover over 'Firefox Multi Account Containers', and select 'always open in container'. Whenever you open that website in normal browsing (e.g. not Private Browsing), it'll open in that container and logged into that account if you don't use an addon to delete cookies.\n6. If you have multiple accounts/don't always want to be logged in, simply click and hold the new tab icon, and open the container first before going to the website.\n\nMAC is also incredibly useful in signing into multiple accounts as well, if you use multiple accounts. Just don't select 'always open in this container', and open the container first.\n\nUse temporary containers for websites you don't want to login to, and the facebook container option is effectively a 'facebook' Container in MAC preset, with some extra stuff thrown in.","link":"https://www.reddit.com/r/firefox/comments/ca1n43/firefox_containers/et5qfix/","name":"t1_et5qfix","ups":3,"author":"An_Account_For_Me_","created":"2019-07-07"},{"kind":"t1","subreddit":"privacy","text":"News flash, WIFI is itself a location indicator. The AP (access point) has a unique ID which the phone knows. This is easily tied to the AP's IP address and so its approximate location.  Of course, the cloud host collects whatever the phone knows. Furthermore, if anyone, ever, passes that AP with their phone's GPS turned on, the cloud now knows the physical location (within a dozen meters) of the AP, continually refined as more phones report in.\n\nThis has all been commercialized by [Skyhook](https://www.skyhook.com/) but it's easy to home grow also.\n\nIf you don't want to be found, keep your phone off or in a Faraday bag. That's not perfect though because of other channels.  Best leave the phone at home if your life depends on it.","link":"https://www.reddit.com/r/privacy/comments/sg6gug/google_recieves_your_location_when_using_wifi/huulyhw/","name":"t1_huulyhw","ups":123,"author":"mnp","created":"2022-01-30"},{"kind":"t1","subreddit":"cursedcomments","text":"Yep, it’s called the euphemism treadmill, and it’s why we keep having new words and phrases for sensitive topics. \n\nOnce a word becomes popular enough, sooner or later it’s going to be used as an insult, and then it’s going to be more known as an insult than an actual descriptor. \n\nAnd that’s exactly what happened with “retarded.”","link":"https://www.reddit.com/r/cursedcomments/comments/sg47ri/cursed_mom/huu9q5k/","name":"t1_huu9q5k","ups":27,"author":"TundieRice","created":"2022-01-30"},{"kind":"t3","subreddit":"Piracy","text":"There's a pop up by Adobe that begs for me to buy their shit programs and won't go away. Any suggestions?","link":"https://www.reddit.com/r/Piracy/comments/sfzjz7/theres_a_pop_up_by_adobe_that_begs_for_me_to_buy/","name":"t3_sfzjz7","ups":2336,"author":"averagenycrat11","created":"2022-01-30"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Complaints about PrivacyGuides","link":"https://www.reddit.com/r/PrivacyGuides/comments/sfo87w/complaints_about_privacyguides/","name":"t3_sfo87w","ups":83,"author":"deepslate_stone","created":"2022-01-29"},{"kind":"t3","subreddit":"worldnews","text":"Anti-aging vaccine clears out dysfunctional cells that cause disease","link":"https://www.reddit.com/r/worldnews/comments/sfffg5/antiaging_vaccine_clears_out_dysfunctional_cells/","name":"t3_sfffg5","ups":1447,"author":"Devils_doohickey","created":"2022-01-29"},{"kind":"t3","subreddit":"privacy","text":"Suicide hotline shares data with for-profit spinoff, raising ethical questions","link":"https://www.reddit.com/r/privacy/comments/seviqv/suicide_hotline_shares_data_with_forprofit/","name":"t3_seviqv","ups":2973,"author":"Stock412","created":"2022-01-28"},{"kind":"t3","subreddit":"coolguides","text":"How to escape a sinking car","link":"https://www.reddit.com/r/coolguides/comments/septva/how_to_escape_a_sinking_car/","name":"t3_septva","ups":154,"author":"NationYell","created":"2022-01-28"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: got a smelly fridge? Dissolve a Tylenol in a glass of water and place it in the fridge for a few hours","link":"https://www.reddit.com/r/LifeProTips/comments/senpcl/lpt_got_a_smelly_fridge_dissolve_a_tylenol_in_a/","name":"t3_senpcl","ups":32,"author":"patrickdm1998","created":"2022-01-28"},{"kind":"t3","subreddit":"anime","text":"I can't stop gushing over WIT Studio's Attack on Titan. The ODM scenes really make you feel like flying.","link":"https://www.reddit.com/r/anime/comments/sd5orv/i_cant_stop_gushing_over_wit_studios_attack_on/","name":"t3_sd5orv","ups":14800,"author":"asilvertintedrose","created":"2022-01-26"},{"kind":"t3","subreddit":"PrivacyGuides","text":"filen.io or mega on privacyguides?","link":"https://www.reddit.com/r/PrivacyGuides/comments/scqvg3/filenio_or_mega_on_privacyguides/","name":"t3_scqvg3","ups":24,"author":"tkchumly","created":"2022-01-25"},{"kind":"t1","subreddit":"Piracy","text":"Interestingly enough, BitTorrent was designed to not use sequential downloading because it was bad for the swarm.  Back when things like Kazaa were popular there was an issue where speeds would slow as the download progressed because everybody had the first bit, half of those would have the middle bit and only a handful had the last bit because once people had the whole file they’d stop sharing it.  Sometimes you’d end up with a whole swarm of people with 99% of a file but the last person with the last bit would leave before the next could finish.  By downloading the bits randomly, or prioritizing the least popular bits the whole swarm would run faster because there’d be greater availability of the later bits. it also helped with initial seeding for the same reasons.","link":"https://www.reddit.com/r/Piracy/comments/sci4js/why_is_μtorrent_so_popular/hu96ctt/","name":"t1_hu96ctt","ups":30,"author":"Kelsenellenelvial","created":"2022-01-26"},{"kind":"t1","subreddit":"Piracy","text":"&gt;Just beware the ads on public sites hehe.\n\nSkip em. [https://i.imgur.com/L2PvsHq.gifv](https://i.imgur.com/L2PvsHq.gifv)\n\nEDIT: sorry forgot to mention this is a qBittorrent feature.\n\nAnd instead of using all the different plugins i personally just use the Jackett plugin cuz that has even more trackers.","link":"https://www.reddit.com/r/Piracy/comments/scjauq/pirating_is_a_must_these_days_with_streaming/hu8w1pr/","name":"t1_hu8w1pr","ups":60,"author":"Cyno01","created":"2022-01-26"},{"kind":"t3","subreddit":"coolguides","text":"US Military Spending versus The World","link":"https://www.reddit.com/r/coolguides/comments/sbul7q/us_military_spending_versus_the_world/","name":"t3_sbul7q","ups":27256,"author":"NotoriousPYG","created":"2022-01-24"},{"kind":"t3","subreddit":"ProtonVPN","text":"VPN not needed if using TOR","link":"https://www.reddit.com/r/ProtonVPN/comments/ku0srb/vpn_not_needed_if_using_tor/","name":"t3_ku0srb","ups":30,"author":"Mindless_Athlete_935","created":"2021-01-09"},{"kind":"t1","subreddit":"LifeProTips","text":"Yes, but we need people who can perform on keyboard. Schools are pumping out lots of CISSP type folks who understand theory (kind of), but can't do things like actually peel apart network traffic, write code, automate detection, or actually hack. This field is extremely technical and is all about where the rubber meets the road. There's a sweeping wave of technical people pushing into senior, principal, and management positions easily overtaking the folks who are non-technical.\n\nAt the entry level, there's too many people with cybersecurity degrees or a single cert who literally can't perform basic command line operations. They are getting hired less and less frequently.\n\nSo, if you want to come into security, fully understand computer networking, users, groups, logging, and permissions of both Windows and Linux, be able to write small scripts (particularly around sending and receiving traffic) in python and bash, and document hands on experience even doing labs or ctfs on a blog like medium so that we can see you can actually use a computer. This will move you instantly to the top of a stack, even above degrees.","link":"https://www.reddit.com/r/LifeProTips/comments/sbc11i/lpt_if_you_value_your_quality_of_life_dont_enter/hu0f54z/","name":"t1_hu0f54z","ups":63,"author":"010kindsofpeople","created":"2022-01-24"},{"kind":"t1","subreddit":"worldnews","text":"This is the best tl;dr I could make, [original](https://news.sky.com/story/two-thirds-of-anti-vax-propaganda-online-created-by-just-12-influencers-research-finds-12521910) reduced by 82%. (I'm a bot)\n*****\n&gt; Mr Ahmed said the algorithms used by social media platforms then fed people more and more similar content, until they see it frequently while online - thus normalising the opinions.\n\n&gt; Ed Stubbs, a teacher who developed a package of lessons designed to tackle vaccine hesitancy in schools, said that because young people spent so much time online they could easily find themselves watching a lot of anti-vax content.\n\n&gt; Chris Philp, a minister in the department for digital, culture, media and sport, said the government would legislate for fines and other action to force social media companies to remove content deemed damaging but admitted that policing the internet was not an easy task.\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/sbknew/twothirds_of_antivax_propaganda_online_created_by/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 2.02, ~619478 tl;drs so far.\") | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PM's and comments are monitored, constructive feedback is welcome.\") | *Top* *keywords*: **vaccine**^#1 **content**^#2 **media**^#3 **people**^#4 **social**^#5","link":"https://www.reddit.com/r/worldnews/comments/sbk15g/twothirds_of_antivax_propaganda_online_created_by/hu0cfw0/","name":"t1_hu0cfw0","ups":524,"author":"autotldr","created":"2022-01-24"},{"kind":"t3","subreddit":"Astronomy","text":"Motion of solar system planets relative to Earth (i.e. geocentric orbits)","link":"https://www.reddit.com/r/Astronomy/comments/s99umt/motion_of_solar_system_planets_relative_to_earth/","name":"t3_s99umt","ups":7983,"author":"exohugh","created":"2022-01-21"},{"kind":"t3","subreddit":"anime_titties","text":"French lawmakers officially recognise China’s treatment of Uyghurs as ‘genocide’","link":"https://www.reddit.com/r/anime_titties/comments/s8ijej/french_lawmakers_officially_recognise_chinas/","name":"t3_s8ijej","ups":4260,"author":"Saltedline","created":"2022-01-20"},{"kind":"t3","subreddit":"privacy","text":"Banishing Ads into the void with Pi-hole","link":"https://www.reddit.com/r/privacy/comments/s85l7n/banishing_ads_into_the_void_with_pihole/","name":"t3_s85l7n","ups":311,"author":"cihansol","created":"2022-01-20"},{"kind":"t1","subreddit":"DataHoarder","text":"If someone who knows more than me wants to take a look, I wont stop them :)\n\nyoutube-dl -o \"~/Desktop/01 Stream Dump/YT-DL/$(date +%m.%d.%y)/$(date +%m.%d.%y) %(title)s.%(ext)s\" https://youtu.be/Vj0XKu6AoOw\n\nThis is what my usual command looks like including the content (youtube video/account I do record).  I either let the recording go for the 6hr limit and it auto stops, or I do \"Crtl+C\" which stops it all and gives me an .mp4 with the stream title and date (in a folder w/the date), ready to play.  \n\nI've been doing it this way with no problems for about 3-4 years, even dlp worked for a while, but with recent updates if I swap in \"yt-dlp\" to the command above I get the wonky mp4.  Even if I remove all my naming scheme and just to \"yt-dlp https://youtu.be/Vj0XKu6AoOw\" the problem persists.\n\nOutput settings for both are nearly identical except for \"muxing overhead:\" which is a larger % in yt-dlp (if that means anything)\n\n\n\n&gt;video:990kB audio:312kB subtitle:0kB other streams:0kB global headers:0kB muxing overhead: 1.481523%\n\n&gt;Exiting normally, received signal 2.\n\n&gt;[ffmpeg] Interrupted by user\n\n&gt;[ffmpeg] Downloaded 1353797 bytes\n\n&gt;[download] 100% of 1.29MiB in 00:10\n\n- youtube-dl\n\n\n\n&gt;video:994kB audio:319kB subtitle:0kB other streams:0kB global headers:0kB muxing overhead: 13.072482%\n\n&gt;Exiting normally, received signal 2.\n\n&gt;[ffmpeg] Interrupted by user\n\n&gt;[ffmpeg] Downloaded 1519416 bytes\n\n&gt;[download] 100% of 1.45MiB in 00:10\n\n\n- yt-dlp\n\n...\n\nOk mid comment writing update lol. I tried some more stuff out and got a few interesting results. \n\nI forgot the mp4 file from yt-dlp opens in vlc fine, just not in quicktime (on my macs, 10.13 or 11.6).  Though, if I run that mp4 through avidemux from mp4 to mkv then back to mp4 it then opens fine in quicktime like youtube-dl files.\n\nIf I use yt-dlp on my windows 10 machine, it seems to opens in the default windows player fine.  If I share that file to my mac, I then get the same problem as above.\n\nSo it's looking like the culprit is something to do with the codec or something that yt-dlp is choosing and it's just not compatible with quicktime?  Though I don't get how \"converting\" it (really just changing containers back and forth) seems to eliminate that problem? / Maybe there's a way to do that in yt-dlp from the start? (read through the documentation and saw there was mention of it looking for a different default codec? as youtube-dl did, but I'm a novice at CL and the few added commands I tried that mentioned live didn't seem to do the trick (If I was even doing it right lol)\n\nThanks!","link":"https://www.reddit.com/r/DataHoarder/comments/s7o5e9/major_record_labels_sue_youtubedls_hosting/htck481/","name":"t1_htck481","ups":4,"author":"PopcornInMyTeeth","created":"2022-01-19"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Tencent is scanning kids' faces to stop them using older relatives' gaming accounts to get around China's gaming restrictions","link":"https://www.reddit.com/r/PrivacyGuides/comments/s7k8x1/tencent_is_scanning_kids_faces_to_stop_them_using/","name":"t3_s7k8x1","ups":256,"author":"a_Ninja_b0y","created":"2022-01-19"},{"kind":"t3","subreddit":"coolguides","text":"Google like a pro","link":"https://www.reddit.com/r/coolguides/comments/s6t87o/google_like_a_pro/","name":"t3_s6t87o","ups":9397,"author":"kjohnsonxew","created":"2022-01-18"},{"kind":"t3","subreddit":"dataisbeautiful","text":"[OC] I spent the last 18 months of lockdown pouring my soul into a website that allows you to visualize virtually every U.S. company's international supply chain. E.g. What products, how much, which factories and where does Walmart import from? (Just type a company in the search box)","link":"https://www.reddit.com/r/dataisbeautiful/comments/s6yhio/oc_i_spent_the_last_18_months_of_lockdown_pouring/","name":"t3_s6yhio","ups":49367,"author":"ImportYeti","created":"2022-01-18"},{"kind":"t1","subreddit":"privacy","text":"1) Make a backup before traveling\n\n2) factory reset the phone before boarding or after boarding\n\n3) restore when crossed border patrol \n\n4) profit ?","link":"https://www.reddit.com/r/privacy/comments/s6u077/returning_travellers_made_to_hand_over_phones_and/ht5tmob/","name":"t1_ht5tmob","ups":429,"author":"g-nice4liief","created":"2022-01-18"},{"kind":"t1","subreddit":"anime_titties","text":"***MAXIMUM COPIUM***\n\nhttps://www.bbc.com/news/world-us-canada-59556613\n\nhttps://thediplomat.com/2021/12/australia-joins-us-in-diplomatic-boycott-of-beijing-olympics/\n\nhttps://www.politico.com/news/2021/12/08/canada-diplomatic-boycott-olympics-523942\n\nhttps://www.japantimes.co.jp/news/2021/12/24/national/japan-olympics-boycotts/\n\nhttps://www.nytimes.com/2021/12/08/world/europe/uk-china-olympics-diplomatic-boycott.html","link":"https://www.reddit.com/r/anime_titties/comments/s6d0yc/china_beijing_winter_olympics_2022_tickets_not_on/ht3p0su/","name":"t1_ht3p0su","ups":26,"author":"SerHodorTheThrall","created":"2022-01-17"},{"kind":"t1","subreddit":"BlueArchive","text":"We're following JP schedule for the most part, just faster. We're expecting the first summer banners in late February. We get Azusa with Hiero next, then Koharu with Binah, then Summer Azusa and Mashiro with ShiroKuro.","link":"https://www.reddit.com/r/BlueArchive/comments/s6mlwj/free_1200_pyroxenes_for_reaching_150k_subs_in_ba/ht5imyb/","name":"t1_ht5imyb","ups":6,"author":"I_ama_homosapien_AMA","created":"2022-01-18"},{"kind":"t1","subreddit":"explainlikeimfive","text":"It’s not bad to take a hot shower during a fever, it’s just uncomfortable. At the same time, taking a cold shower is not recommended because as your skin (periphery) cools down due to cold water, the body tries to compensate by increasing your core (inside) temperature which we don’t want in a patient already suffering from fever. Hence lukewarm water is the best for this situation.\n\nNow there are chemical compounds called pyrogens (molecules that cause fever). Usually the process goes like this : bacteria/virus/microorganisms enter our body, body/immune system detects certain proteins and chemical structures on them (like the cell wall,etc), sends a signal to the brain, brain is like oops need to kill that, need more ammo, so they release some other substances/chemical compounds which further activates the immune system. \nNow both the microorganisms and the brain/immune system’s compounds are what we call pyrogens.\n\nSo exogenous ( from outside) pyrogens like bacteria give rise to endogenous (from inside the body) pyrogens like the immune system cells which increases the body temperature level just the way you adjust the thermostat to a higher setting.\n\nHope this helps. Feel free to ask any questions :)\n\nEdit : Thanks for all the upvotes and awards, science is great, I love it\n\nEdit : adding this signalling pathway for people who are interested\n\nso bacteria inside the body — bacterial cell wall has certain proteins on it —— immune cells (mainly macrophages, first line of defence) detect those proteins —— immune cells go to the protein (hence the bacteria) binds to it —— this binding results in a release of bunch of other chemicals (interleukins) —- release of these chemicals activates an enzyme (enzymes are proteins that make chemical reactions happen/happen faster) —- this enzyme releases something called PGE2 ( a prostaglandin) ——- this PGE2 acts like a hormone —- go to the nerve cells in hypothalamus part of the brain—— hypothalamus detects this PGE2 and understands that temp of the body must be raised —- so it tells the muscles to produce more heat, diverts blood from periphery to the core and breaks down some fat cells as they produce heat\n\nEdit : omg this blew up, I love being able to share all this with you guys, sorry for late replies, I was at work","link":"https://www.reddit.com/r/explainlikeimfive/comments/s5ydwn/eli5_if_the_body_raises_its_temperature_to_kill/ht0p6gg/","name":"t1_ht0p6gg","ups":3027,"author":"awkguy13","created":"2022-01-17"},{"kind":"t1","subreddit":"PrivacyGuides","text":"As was mentioned in a previous comment, this can only really be achieved through reproducable builds. What does that mean? It means that when compiled and built from source, the binary result will always be the exact same. By doing this, you can build the binary from source, download the given binary, and calculate and compare checksums. If even a single bit was changed, the checksums would not match, and you'd know that the provided binaries are different than the source code you used.\n\nNow again, you can only do this when there are reproducable builds, and you use the *exact* source code (make sure there isn't a version mismatch), and that only works for binaries you install yourself. In order to ensure the correct software is running on a server you cannot access, you'd have to rely on either an independent audit, or pure trust. With ProtonMail, for instance, their servers are independently audited. Additionally, their model of zero-access encryption ensures that so long as the source code of your client application (what you use as a user, like the Android or desktop app) is correct, only you would be able to decrypt your emails. They will not have access to the keys, so even a malicious server would be safe since encryption is done on the client-side.\n\nBut in general, you often can't know for sure that a server is running the exact code from their published source code. This is one of the reasons why I personally self-host any of the services I don't have the same safety with as ProtonMail. I self-host my Bitwarden vault, a Matrix server, Nextcloud, and calendar and contacts syncing. That list may expand in the future, but self-hosting services ensures the source code matches the binaries. For the average person, you often just have to have trust in the service you're using if the client application does not have failsafes to prevent malicious servers.","link":"https://www.reddit.com/r/PrivacyGuides/comments/rztf96/how_can_we_know_that_the_published_source_code/hrz4cqd/","name":"t1_hrz4cqd","ups":4,"author":"para_lyzed","created":"2022-01-09"},{"kind":"t3","subreddit":"animepiracy","text":"Unable to create release on Nyaa?","link":"https://www.reddit.com/r/animepiracy/comments/s61cm4/unable_to_create_release_on_nyaa/","name":"t3_s61cm4","ups":147,"author":"Hatefiend","created":"2022-01-17"},{"kind":"t1","subreddit":"privacy","text":"use pihole to\n1.\tbe shocked when seeing how many malicious requests those make\n2.\t*actually* block them","link":"https://www.reddit.com/r/privacy/comments/s5mhjj/dont_let_your_roku_apple_tv_or_other_streamer/ht0xcfa/","name":"t1_ht0xcfa","ups":32,"author":"OxygenOS","created":"2022-01-17"},{"kind":"t1","subreddit":"privacy","text":"Tik-Tok is owned by the Chinese government and has a AI programs that sweep the background of your videos for information and clues as to who you are and where you are. They do this worldwide to everyone, not just Chinese citizens. The CCP is using Tik-Tok to gather data on everybody.","link":"https://www.reddit.com/r/privacy/comments/s5c5k7/revealed_uk_govt_plans_publicity_blitz_to/hsxip9v/","name":"t1_hsxip9v","ups":72,"author":"Needleroozer","created":"2022-01-16"},{"kind":"t3","subreddit":"dadjokes","text":"SERIOUS: This subreddit needs to understand what a \"dad joke\" really means.","link":"https://www.reddit.com/r/dadjokes/comments/s4kste/serious_this_subreddit_needs_to_understand_what_a/","name":"t3_s4kste","ups":17463,"author":"anywhereiroa","created":"2022-01-15"},{"kind":"t3","subreddit":"LearnUselessTalents","text":"Visual Proofs for Power Sums n, n^2. Sum of Arithmetic Sequence ,Sum of ...","link":"https://www.reddit.com/r/LearnUselessTalents/comments/s42zmz/visual_proofs_for_power_sums_n_n2_sum_of/","name":"t3_s42zmz","ups":206,"author":"MathPhysicsEngineer","created":"2022-01-14"},{"kind":"t3","subreddit":"goodanimemes","text":"The anime had ended on such an amazing note that I just had to finish the manga as well. BIG MISTAKE!","link":"https://www.reddit.com/r/goodanimemes/comments/s3768y/the_anime_had_ended_on_such_an_amazing_note_that/","name":"t3_s3768y","ups":4066,"author":"Dr_Backpropagation","created":"2022-01-13"},{"kind":"t3","subreddit":"dataisbeautiful","text":"[OC] Turns out it is mostly the unvaccinated dying: CDC COVID Data","link":"https://www.reddit.com/r/dataisbeautiful/comments/s2flsu/oc_turns_out_it_is_mostly_the_unvaccinated_dying/","name":"t3_s2flsu","ups":10842,"author":"faulerauslaender","created":"2022-01-12"},{"kind":"t3","subreddit":"privacy","text":"What's the Most App Trackers You Have Seen?","link":"https://www.reddit.com/r/privacy/comments/s1dy7i/whats_the_most_app_trackers_you_have_seen/","name":"t3_s1dy7i","ups":212,"author":"Cheapskate2020","created":"2022-01-11"},{"kind":"t3","subreddit":"PrivacyGuides","text":"List of Open Source alternative frontends for popular services/social media","link":"https://www.reddit.com/r/PrivacyGuides/comments/rqi67g/list_of_open_source_alternative_frontends_for/","name":"t3_rqi67g","ups":277,"author":"Akid0uu","created":"2021-12-28"},{"kind":"t3","subreddit":"privacy","text":"It's impossible for someone to grow up privately","link":"https://www.reddit.com/r/privacy/comments/s05v9q/its_impossible_for_someone_to_grow_up_privately/","name":"t3_s05v9q","ups":838,"author":"spotracite","created":"2022-01-10"},{"kind":"t3","subreddit":"privacy","text":"If someone says why they should care about privacy, just ask them if they have curtains in their home.","link":"https://www.reddit.com/r/privacy/comments/rz3nga/if_someone_says_why_they_should_care_about/","name":"t3_rz3nga","ups":1690,"author":"coffeecaketea","created":"2022-01-08"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Open-source tests of web browser privacy","link":"https://www.reddit.com/r/PrivacyGuides/comments/rz11x8/opensource_tests_of_web_browser_privacy/","name":"t3_rz11x8","ups":203,"author":"NmAmDa","created":"2022-01-08"},{"kind":"t1","subreddit":"PrivacyGuides","text":"https://librewolf.net/docs/features/","link":"https://www.reddit.com/r/PrivacyGuides/comments/rz11x8/opensource_tests_of_web_browser_privacy/hrt5iw8/","name":"t1_hrt5iw8","ups":10,"author":"adbot-01","created":"2022-01-08"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Drag and Drop files - A Privacy concern I have in it","link":"https://www.reddit.com/r/PrivacyGuides/comments/ryqnde/drag_and_drop_files_a_privacy_concern_i_have_in_it/","name":"t3_ryqnde","ups":30,"author":"Mc_King_95","created":"2022-01-08"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: Normalise teaching your kids that safe adults don’t ask you to keep secrets from other adults","link":"https://www.reddit.com/r/LifeProTips/comments/rxpfnr/lpt_normalise_teaching_your_kids_that_safe_adults/","name":"t3_rxpfnr","ups":67009,"author":"Expensive_Equal6747","created":"2022-01-06"},{"kind":"t3","subreddit":"PrivacyGuides","text":"TheAnonymousJoker - false privacy prophet, misinformation, delusions, and master of giving harmful privacy/security advice.","link":"https://www.reddit.com/r/PrivacyGuides/comments/rxf02a/theanonymousjoker_false_privacy_prophet/","name":"t3_rxf02a","ups":211,"author":"[deleted]","created":"2022-01-06"},{"kind":"t1","subreddit":"privacy","text":"https://madaidans-insecurities.github.io/firefox-chromium.html","link":"https://www.reddit.com/r/privacy/comments/rx4rzq/facebook_collecting_peoples_data_even_when/hrgxf1m/","name":"t1_hrgxf1m","ups":-1,"author":"SewerSmell","created":"2022-01-06"},{"kind":"t1","subreddit":"privacy","text":"Anything they can collect from your device, they do. They do that across sites. They know your browser and version, your OS and version, your device, the size and resolution of your screen. If you allow location services, they know your general area regardless of VPN. Then each of them have some extra pieces. Amazon knows your shopping history and the things you don't buy, but look at. Google knows your search history and a lot more if you have a gmail account and browse while logged in. Google and Facebook know a lot about you because every site you visit has a call back to Google Analytics, re-captcha, and Facebook Like buttons. All of those run scripts on your browser and collect as much info as they can, regardless if you even have an account or not.\n\nUsing the tools you mention limits the amount of data they collect from you, but doesn't make it zero. Tor would be a best option, but even then it's not perfect.\n\nThe reality is that this is not a technical problem, and therefore there is no technical solution.\n\nThe only solution is regulation that criminalizes the business model, and this will never happen because your like is worth far less than the billions of dollars this model generates every year. This state of affairs will continue indefinitely, until people start understanding what's being done to them and start voting based on that, and holding their representatives accountable. TL;DR this will never happen either, because people are addicted to these \"free\" services and refuse to understand why it is even a problem.","link":"https://www.reddit.com/r/privacy/comments/ru9x3b/big_data_may_not_know_your_name_but_it_knows/hqyb6bq/","name":"t1_hqyb6bq","ups":33,"author":"wordserious","created":"2022-01-02"},{"kind":"t1","subreddit":"LifeProTips","text":"Don't trust them,  but if you think your employer is breaking the law,  contact them via email, blind copy your personal email and forward the response to yourself.  HR is there to protect the company as a whole.  If your supervisor is doing something that puts the company at risk,  such as sexual harassment or discrimination,  HR is there to stop it. \nOccasionally the best interest of the company and the employee are the same..... occasionally.","link":"https://www.reddit.com/r/LifeProTips/comments/rqj0rp/lpt_hr_is_not_on_your_side_their_position_is/hqajjru/","name":"t1_hqajjru","ups":7673,"author":"jj77985","created":"2021-12-28"},{"kind":"t3","subreddit":"YouShouldKnow","text":"YSK: How to cook with garlic. The tinier you mince garlic, the stronger the flavor. Slices will be less strong while a paste will be strongest. The more you cook it the more flavor will be lost.","link":"https://www.reddit.com/r/YouShouldKnow/comments/rqgygv/ysk_how_to_cook_with_garlic_the_tinier_you_mince/","name":"t3_rqgygv","ups":30254,"author":"1saltymf","created":"2021-12-28"},{"kind":"t3","subreddit":"privacy","text":"We all knew that newer cars are terrible for privacy, but to what extent? Being the owner of a 2018 Honda, I decided to look further into their privacy practices","link":"https://www.reddit.com/r/privacy/comments/rppo3p/we_all_knew_that_newer_cars_are_terrible_for/","name":"t3_rppo3p","ups":419,"author":"_N_S_R_","created":"2021-12-27"},{"kind":"t3","subreddit":"YouShouldKnow","text":"YSK about the Fundamental Attribution Error, a key concept in psychology where we judge others based on their actions but ourselves based on our intent.","link":"https://www.reddit.com/r/YouShouldKnow/comments/rob9kl/ysk_about_the_fundamental_attribution_error_a_key/","name":"t3_rob9kl","ups":41098,"author":"bearjew64","created":"2021-12-25"},{"kind":"t1","subreddit":"anime","text":"Have you tried:\n\n- Yama no Susume\n\n- Non Non Biyori\n\n- Hakumei to Mikochi\n\n- Kamichu!\n\n- Girls' Last Tour\n\n?","link":"https://www.reddit.com/r/anime/comments/qzh9gi/slow_loop_new_key_visual/hlohcmd/","name":"t1_hlohcmd","ups":21,"author":"Barbed_Dildo","created":"2021-11-22"},{"kind":"t1","subreddit":"privacy","text":"First they came for the socialists, and I did not speak out—\n     Because I was not a socialist. \n\nThen they came for the trade unionists, and I did not speak out—\n     Because I was not a trade unionist. \n\nThen they came for the Jews, and I did not speak out—\n     Because I was not a Jew. \n\nThen they came for me—and there was no one left to speak for me.","link":"https://www.reddit.com/r/privacy/comments/rn261v/why_should_i_care_about_privacy_though/hpr2dm9/","name":"t1_hpr2dm9","ups":66,"author":"IgniteThatShit","created":"2021-12-24"},{"kind":"t3","subreddit":"privacy","text":"Any good tools for removing EXIF data from photos and videos?","link":"https://www.reddit.com/r/privacy/comments/rjo3dw/any_good_tools_for_removing_exif_data_from_photos/","name":"t3_rjo3dw","ups":20,"author":"MarsPicasso","created":"2021-12-19"},{"kind":"t3","subreddit":"privacy","text":"Chinese Spies Accused of Using Huawei in Secret Australia Telecom Hack","link":"https://www.reddit.com/r/privacy/comments/rifk7m/chinese_spies_accused_of_using_huawei_in_secret/","name":"t3_rifk7m","ups":298,"author":"thegreatblazed","created":"2021-12-17"},{"kind":"t3","subreddit":"privacy","text":"Windows 11 Officially Shuts Down Firefox’s Default Browser Workaround","link":"https://www.reddit.com/r/privacy/comments/rhxi29/windows_11_officially_shuts_down_firefoxs_default/","name":"t3_rhxi29","ups":2108,"author":"a_Ninja_b0y","created":"2021-12-16"},{"kind":"t1","subreddit":"privacy","text":"Different companies have different models. There is no single way.\n\nGoogle, for example, gathers analytics on pretty much every aspect of your life in order to sell targeted advertisement to advertisers based on searches, preferences, habits, etc. they do not give the users analytics or information to the advertisers. They keep that data on lock.\n\nFacebook, for example, might sell or allow access to user information to companies such as Cambridge analytica and… well…\nhttps://www.wired.com/story/cambridge-analytica-facebook-privacy-awakening/\n\nAs far as how they get the data I’m pretty sure they don’t get handed a physical file. They’re given access to an API where they can query or they are FTP’d a database file.","link":"https://www.reddit.com/r/privacy/comments/rm6s5l/how_exactly_is_our_data_stored_database_selling/hpkbjze/","name":"t1_hpkbjze","ups":5,"author":"JeremyAultCyberSec","created":"2021-12-22"},{"kind":"t1","subreddit":"Showerthoughts","text":"1. Don’t search questions?\n2. Use the -minus sign to eliminate results you don’t want.\n3. “Use quotation marks” in order to get text results next to each other, as opposed to separated.\n4. Use AND to see results that have both terms.\n5. Use OR to see results that have one term but not the other.","link":"https://www.reddit.com/r/Showerthoughts/comments/rgyhg9/its_a_better_idea_to_teach_students_how_to_get/honujkj/","name":"t1_honujkj","ups":2,"author":"Floridamanticus","created":"2021-12-15"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Where do I start with self-hosting?","link":"https://www.reddit.com/r/PrivacyGuides/comments/rgxqpj/where_do_i_start_with_selfhosting/","name":"t3_rgxqpj","ups":12,"author":"peternordstorm","created":"2021-12-15"},{"kind":"t3","subreddit":"PrivacyGuides","text":"I wrote a full guide for privacy&amp;degoogle on android!","link":"https://www.reddit.com/r/PrivacyGuides/comments/rfiuwq/i_wrote_a_full_guide_for_privacydegoogle_on/","name":"t3_rfiuwq","ups":130,"author":"jwensouls","created":"2021-12-13"},{"kind":"t1","subreddit":"cursedcomments","text":"isn't there also r/FemaleDatingStratPros yup there is and oh my fucking god it's worse","link":"https://www.reddit.com/r/cursedcomments/comments/reloji/cursed_stupid/ho9p1q6/","name":"t1_ho9p1q6","ups":7,"author":"CristolerGm2","created":"2021-12-12"},{"kind":"t3","subreddit":"privacy","text":"Report: iOS Users Who Opt-Out of App Tracking Continue to Be Tracked by Facebook and Snapchat","link":"https://www.reddit.com/r/privacy/comments/rbu8op/report_ios_users_who_optout_of_app_tracking/","name":"t3_rbu8op","ups":1200,"author":"Alejandrohh98","created":"2021-12-08"},{"kind":"t1","subreddit":"PrivacyGuides","text":"\n&gt;I can't completely cut out Google services and Facebook\n\nThat's alright! Think of Privacy as a spectrum not a leap of faith.\n\nNow on to the baby steps:\n\n1) go to [Google Activity Controls](https://myaccount.google.com/intro/activitycontrols) and disable as much as you can. (Do note, disabling the youtube one will give you worse recommendations, but if you're okay with that disable it)\n\n2) Change your Facebook privacy settings ([Guide for that](https://www.androidauthority.com/facebook-privacy-settings-848172/) first two points are deactivate/delete so scroll down and follow the rest if you don't want to delete)\n\n3) Firefox and DDG with *uBlock Origin* (not *ublock*) + LocalCDN + ~~HTTPS everywhere~~ you don't need the extention [Firefox has this built-in](https://support.mozilla.org/en-US/kb/https-only-prefs) + ClearURLs. Drop the other extensions\n\n4) You asked in an other comment so: DNS is the phone book of the internet. You know the name of the restaurant you want to visit but not the phone number so you look that up in the phone book and that phone book is the DNS server. ([Reference image](https://www.keycdn.com/img/support/what-is-a-dns-server.png)) here the website name is sent to the DNS server and it sends back the IP (read: phone number) to your browser and your browser takes you to the website\n\nBy that when an advert asks the DNS server for a advert website(Example: Google Analytics) the DNS server sends a blank address and the advert never gets connected therefore blocked\n\n5) Piracy is never ideal but make sure to read up on r/piracy/wiki/guides and check out r/Piracy/wiki/megathread\n\n6) Make it a habit to go into your apps/accounts and change the privacy settings (yes even reddit)","link":"https://www.reddit.com/r/PrivacyGuides/comments/q1u3jl/baby_step_tips_on_improving_phone_and_browser/hfh89v4/","name":"t1_hfh89v4","ups":44,"author":"Urban-Element_9D6n","created":"2021-10-05"},{"kind":"t3","subreddit":"YouShouldKnow","text":"YSK If your car is totaled, tell your insurance company to find 3 similar vehicles in the market for the amount of $ they're offering. You do NOT have to accept their first offer or agree to repair a car which often times SHOULD NOT be repaired.","link":"https://www.reddit.com/r/YouShouldKnow/comments/raro9d/ysk_if_your_car_is_totaled_tell_your_insurance/","name":"t3_raro9d","ups":18907,"author":"saaatchmo","created":"2021-12-07"},{"kind":"t3","subreddit":"privacy","text":"The Verizon app might be collecting your browsing history and more | Verizon says it’s to better “understand your interests”","link":"https://www.reddit.com/r/privacy/comments/ra4wfi/the_verizon_app_might_be_collecting_your_browsing/","name":"t3_ra4wfi","ups":1325,"author":"chrisdh79","created":"2021-12-06"},{"kind":"t3","subreddit":"firefox","text":"Firefox keeps autosuggestion websites after deleting history and cookies.","link":"https://www.reddit.com/r/firefox/comments/24s1ad/firefox_keeps_autosuggestion_websites_after/","name":"t3_24s1ad","ups":0,"author":"lordclown","created":"2014-05-05"},{"kind":"t3","subreddit":"askscience","text":"Today I was in a 15 story building during an earthquake. If the building collapsed, would I have been safer on the first floor, 15th floor or somewhere in between?","link":"https://www.reddit.com/r/askscience/comments/11m22d/today_i_was_in_a_15_story_building_during_an/","name":"t3_11m22d","ups":632,"author":"creedofwheat","created":"2012-10-17"},{"kind":"t3","subreddit":"privacy","text":"Don’t Just Delete Facebook, Poison Your Data First","link":"https://www.reddit.com/r/privacy/comments/887hfg/dont_just_delete_facebook_poison_your_data_first/","name":"t3_887hfg","ups":113,"author":"benjancewicz","created":"2018-03-30"},{"kind":"t3","subreddit":"dataisbeautiful","text":"[OC] 8 Perfect Shuffles: Shuffling a deck of cards perfectly 8 times will return it to its original order. seems remarkable, but here is the visual proof/movement of the cards. Might not fit here, but thought I would share! Some other cool phenomenon can be seen in each shuffle!","link":"https://www.reddit.com/r/dataisbeautiful/comments/r9b8uz/oc_8_perfect_shuffles_shuffling_a_deck_of_cards/","name":"t3_r9b8uz","ups":22993,"author":"TheRealFranklinS","created":"2021-12-05"},{"kind":"t1","subreddit":"Piracy","text":"Been using kindle for around 2 years now.\nYou dont even need calibre,as someone mentioned download ebooks in .mobi format from z-lib.org and send them to your kindle using email or through USB\n\nAlternatively you can also just send pdfs to your kindle device through email and write CONVERT in the subject. Kindle makes the conversions automatically\n\nHappy reading","link":"https://www.reddit.com/r/Piracy/comments/r97km3/bought_a_kindle_for_my_daughter_thought_i_could/hnakk62/","name":"t1_hnakk62","ups":401,"author":"toomuchansh","created":"2021-12-05"},{"kind":"t3","subreddit":"dataisbeautiful","text":"[OC] The first 9 Principle Components(aka \"Eigenfaces\") of a dataset of over 13,000 pictures of faces. Using just these 9 building blocks, you can re-create over 50% of the information in the entire dataset. So much of the variance we see is explained by angle of illumination.","link":"https://www.reddit.com/r/dataisbeautiful/comments/r7ssxg/oc_the_first_9_principle_componentsaka_eigenfaces/","name":"t3_r7ssxg","ups":12183,"author":"Syntaximus","created":"2021-12-03"},{"kind":"t3","subreddit":"privacy","text":"Document Shows How FBI Retrieve data from WhatsApp and Popular Secure Messaging Apps","link":"https://www.reddit.com/r/privacy/comments/r5jey4/document_shows_how_fbi_retrieve_data_from/","name":"t3_r5jey4","ups":57,"author":"Vivek56","created":"2021-11-30"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Privacy addiction","link":"https://www.reddit.com/r/PrivacyGuides/comments/r4xmxs/privacy_addiction/","name":"t3_r4xmxs","ups":139,"author":"onewayout1972","created":"2021-11-29"},{"kind":"t3","subreddit":"privacy","text":"If anybody is looking for a book to read, I recommend The Age of Surveillance Capitalism by Shoshana Zuboff.","link":"https://www.reddit.com/r/privacy/comments/r4igy3/if_anybody_is_looking_for_a_book_to_read_i/","name":"t3_r4igy3","ups":294,"author":"DrRacePace","created":"2021-11-29"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: Learn positive self talk. It will change your outlook on just about everything. Especially if your current inner dialogue is negative/overly pessimistic. Talking yourself up like your achievements are the super coolest thing is a great way to be happier.","link":"https://www.reddit.com/r/LifeProTips/comments/r4mo1p/lpt_learn_positive_self_talk_it_will_change_your/","name":"t3_r4mo1p","ups":25103,"author":"fullfrontalfluidity","created":"2021-11-29"},{"kind":"t3","subreddit":"PrivacyGuides","text":"Libreddit: Private front-end for Reddit","link":"https://www.reddit.com/r/PrivacyGuides/comments/r4jyhi/libreddit_private_frontend_for_reddit/","name":"t3_r4jyhi","ups":360,"author":"s87d","created":"2021-11-29"},{"kind":"t3","subreddit":"techsupportgore","text":"My brother-in-law bought a cheap 2TB ssd, but he said it was slow and not working properly, so he wanted me to check it out and… nice","link":"https://www.reddit.com/r/techsupportgore/comments/r3v6k3/my_brotherinlaw_bought_a_cheap_2tb_ssd_but_he/","name":"t3_r3v6k3","ups":5905,"author":"Mayban36","created":"2021-11-28"},{"kind":"t3","subreddit":"PrivacyGuides","text":"PSA: whether you use signal, element/matrix, xmpp, briar, etc, you're doing good!","link":"https://www.reddit.com/r/PrivacyGuides/comments/r21ois/psa_whether_you_use_signal_elementmatrix_xmpp/","name":"t3_r21ois","ups":248,"author":"alexanderb35","created":"2021-11-25"},{"kind":"t3","subreddit":"privacy","text":"If you travel with encrypted laptop/devices/files, read this","link":"https://www.reddit.com/r/privacy/comments/r1z75w/if_you_travel_with_encrypted_laptopdevicesfiles/","name":"t3_r1z75w","ups":832,"author":"stKKd","created":"2021-11-25"},{"kind":"t3","subreddit":"Piracy","text":"Is there a way to view deleted, privated or delisted YouTube videos?","link":"https://www.reddit.com/r/Piracy/comments/r111zo/is_there_a_way_to_view_deleted_privated_or/","name":"t3_r111zo","ups":1237,"author":"Penis-Envys","created":"2021-11-24"},{"kind":"t1","subreddit":"Piracy","text":"[recovermy.video](http://recovermy.video)\n\nThank me later.","link":"https://www.reddit.com/r/Piracy/comments/r111zo/is_there_a_way_to_view_deleted_privated_or/hlwdidd/","name":"t1_hlwdidd","ups":61,"author":"zodiacthemaniac2811","created":"2021-11-24"},{"kind":"t3","subreddit":"explainlikeimfive","text":"eli5: Why is the galaxy flat?","link":"https://www.reddit.com/r/explainlikeimfive/comments/r142mq/eli5_why_is_the_galaxy_flat/","name":"t3_r142mq","ups":6654,"author":"[deleted]","created":"2021-11-24"},{"kind":"t3","subreddit":"privacy","text":"Monitoring an Anonymity Network: Toward The Deanonymization of Hidden Services","link":"https://www.reddit.com/r/privacy/comments/r0xnrd/monitoring_an_anonymity_network_toward_the/","name":"t3_r0xnrd","ups":222,"author":"realgoneman","created":"2021-11-24"},{"kind":"t3","subreddit":"Piracy","text":"Because of Youtube removing the dislike feature I can't tell weather a download tutorial is fake or not based on the amount of dislike like I used to.","link":"https://www.reddit.com/r/Piracy/comments/r05rcs/because_of_youtube_removing_the_dislike_feature_i/","name":"t3_r05rcs","ups":3160,"author":"Sunny2marrow","created":"2021-11-23"},{"kind":"t3","subreddit":"privacy","text":"What's better, to delete a FB account, or to abandon it never updating it?","link":"https://www.reddit.com/r/privacy/comments/r0aqko/whats_better_to_delete_a_fb_account_or_to_abandon/","name":"t3_r0aqko","ups":920,"author":"jherazob","created":"2021-11-23"},{"kind":"t3","subreddit":"Piracy","text":"Everything like it should be: reviving some memories and not giving money to this bastards.","link":"https://www.reddit.com/r/Piracy/comments/qzgj4p/everything_like_it_should_be_reviving_some/","name":"t3_qzgj4p","ups":3820,"author":"themanasdaskid","created":"2021-11-22"},{"kind":"t3","subreddit":"NintendoSwitch","text":"Free Giveaway! OLED Switch and 4 games! - International","link":"https://www.reddit.com/r/NintendoSwitch/comments/qyb9eu/free_giveaway_oled_switch_and_4_games/","name":"t3_qyb9eu","ups":16448,"author":"WolfLemon36","created":"2021-11-20"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: HR can't be on your side unless you make them","link":"https://www.reddit.com/r/LifeProTips/comments/qyu4e0/lpt_hr_cant_be_on_your_side_unless_you_make_them/","name":"t3_qyu4e0","ups":49465,"author":"Kari-kateora","created":"2021-11-21"},{"kind":"t3","subreddit":"explainlikeimfive","text":"ELI5: Does working out for 10 minutes every day do anything or do you have to do a minimum amount of exercise to see any benefit?","link":"https://www.reddit.com/r/explainlikeimfive/comments/qyhjwz/eli5_does_working_out_for_10_minutes_every_day_do/","name":"t3_qyhjwz","ups":11495,"author":"Afireonthesnow","created":"2021-11-20"},{"kind":"t3","subreddit":"explainlikeimfive","text":"ELI5: What is stickiness and do we have a measure for stickiness?","link":"https://www.reddit.com/r/explainlikeimfive/comments/qxkoak/eli5_what_is_stickiness_and_do_we_have_a_measure/","name":"t3_qxkoak","ups":4612,"author":"plantsnvodka","created":"2021-11-19"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: If you're trying to delete your data with a company and they ever ask what region you're in, the correct answer is always California","link":"https://www.reddit.com/r/LifeProTips/comments/qx2dl5/lpt_if_youre_trying_to_delete_your_data_with_a/","name":"t3_qx2dl5","ups":42786,"author":"SuperiorOnions","created":"2021-11-18"},{"kind":"t3","subreddit":"privacy","text":"Reddit tracks you over private/incognito sessions, linking interests with your main account","link":"https://www.reddit.com/r/privacy/comments/qw06fa/reddit_tracks_you_over_privateincognito_sessions/","name":"t3_qw06fa","ups":1438,"author":"Web-Dude","created":"2021-11-17"},{"kind":"t3","subreddit":"toarumajutsunoindex","text":"Railguns Shoot","link":"https://www.reddit.com/r/toarumajutsunoindex/comments/qvk4b8/railguns_shoot/","name":"t3_qvk4b8","ups":72,"author":"FakerArts","created":"2021-11-16"},{"kind":"t1","subreddit":"explainlikeimfive","text":"4/0 isn't irrational.  It is undefined.\n\nIn simplest terms a rational number is one that can be represented as a fraction.  The fraction 0/4 IS, pretty much by definition, a fraction.  Thus it is rational.\n\nAn irrational number is sometimes represented/approximated as a series, since a single fraction can not be used.  For example pi is about = 4/1 - 4/3 + 4/5 - 4/7 + 4/9 - 4/11 + 4/13 - 4/15 + ...  You can get pi to as many digits as you want by driving the series far enough.\n\nDivision by zero is undefined.","link":"https://www.reddit.com/r/explainlikeimfive/comments/qvyu5q/eli5_why_is_40_irrational_but_04_is_rational/hl06voz/","name":"t1_hl06voz","ups":1214,"author":"grayputer","created":"2021-11-17"},{"kind":"t3","subreddit":"DataHoarder","text":"What, in your opinion, goes in the Data Hoarder toolkit?","link":"https://www.reddit.com/r/DataHoarder/comments/qvhp57/what_in_your_opinion_goes_in_the_data_hoarder/","name":"t3_qvhp57","ups":231,"author":"john_stamosdef","created":"2021-11-16"},{"kind":"t3","subreddit":"privacy","text":"Don't count on the eu for privacy and civil rights","link":"https://www.reddit.com/r/privacy/comments/qv352m/dont_count_on_the_eu_for_privacy_and_civil_rights/","name":"t3_qv352m","ups":586,"author":"[deleted]","created":"2021-11-16"},{"kind":"t3","subreddit":"InternetIsBeautiful","text":"A website where you can watch free online documentaries about astronomy, nature, brain, science, health, lifehack documentaries.","link":"https://www.reddit.com/r/InternetIsBeautiful/comments/qtxgyd/a_website_where_you_can_watch_free_online/","name":"t3_qtxgyd","ups":9713,"author":"Imchaman","created":"2021-11-14"},{"kind":"t3","subreddit":"Piracy","text":"It's ingrained in my memory","link":"https://www.reddit.com/r/Piracy/comments/qg4xi8/its_ingrained_in_my_memory/","name":"t3_qg4xi8","ups":10118,"author":"strra","created":"2021-10-26"},{"kind":"t3","subreddit":"Piracy","text":"Somehow was caught?","link":"https://www.reddit.com/r/Piracy/comments/qsngie/somehow_was_caught/","name":"t3_qsngie","ups":22,"author":"J_T_09","created":"2021-11-12"},{"kind":"t3","subreddit":"Piracy","text":"Microsoft activation script won't run on windows 10 21H1","link":"https://www.reddit.com/r/Piracy/comments/qjm34i/microsoft_activation_script_wont_run_on_windows/","name":"t3_qjm34i","ups":0,"author":"tolai_nd","created":"2021-10-31"},{"kind":"t3","subreddit":"Piracy","text":"Unable to activate office, I have tried KMS auto net, KMS all and MAS. They all stuck (see image) and doest do anything. I opened it as Admin. Download office from site given in megathread","link":"https://www.reddit.com/r/Piracy/comments/pfyoyy/unable_to_activate_office_i_have_tried_kms_auto/","name":"t3_pfyoyy","ups":0,"author":"Thilak_Rox","created":"2021-09-01"},{"kind":"t3","subreddit":"Piracy","text":"Excel not genuine","link":"https://www.reddit.com/r/Piracy/comments/pz1zg2/excel_not_genuine/","name":"t3_pz1zg2","ups":3,"author":"Kylael","created":"2021-10-01"},{"kind":"t3","subreddit":"memes","text":"Wait, how?","link":"https://www.reddit.com/r/memes/comments/qrkfn1/wait_how/","name":"t3_qrkfn1","ups":21481,"author":"Cars-and-stuffz","created":"2021-11-11"},{"kind":"t3","subreddit":"YouShouldKnow","text":"YSK the signs of stroke and what to do.","link":"https://www.reddit.com/r/YouShouldKnow/comments/qr8pxk/ysk_the_signs_of_stroke_and_what_to_do/","name":"t3_qr8pxk","ups":7970,"author":"Boosterspice","created":"2021-11-11"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: how do you deal with work burnout and stress?","link":"https://www.reddit.com/r/LifeProTips/comments/qqh6t4/lpt_how_do_you_deal_with_work_burnout_and_stress/","name":"t3_qqh6t4","ups":5297,"author":"Jollymoose1","created":"2021-11-10"},{"kind":"t3","subreddit":"worldpolitics","text":"Destruction 💯","link":"https://www.reddit.com/r/worldpolitics/comments/qpcyzl/destruction/","name":"t3_qpcyzl","ups":3396,"author":"Bullettoothtony308","created":"2021-11-08"},{"kind":"t3","subreddit":"explainlikeimfive","text":"Eli5: how does Jupiter stay together?","link":"https://www.reddit.com/r/explainlikeimfive/comments/qnztjk/eli5_how_does_jupiter_stay_together/","name":"t3_qnztjk","ups":480,"author":"MrReedleDeedle","created":"2021-11-06"},{"kind":"t3","subreddit":"explainlikeimfive","text":"ELI5 If high blood pressure is caused by your heart overworking itself, why does exercise which force your heart to work harder lower blood pressure?","link":"https://www.reddit.com/r/explainlikeimfive/comments/qo24fr/eli5_if_high_blood_pressure_is_caused_by_your/","name":"t3_qo24fr","ups":6932,"author":"DrWrecker","created":"2021-11-06"},{"kind":"t3","subreddit":"coolguides","text":"Do you know who is watching you online?","link":"https://www.reddit.com/r/coolguides/comments/qmkadj/do_you_know_who_is_watching_you_online/","name":"t3_qmkadj","ups":7004,"author":"regian24","created":"2021-11-04"},{"kind":"t3","subreddit":"dataisbeautiful","text":"[OC] How dangerous cleaning the CHERNOBYL reactor roof REALLY was?","link":"https://www.reddit.com/r/dataisbeautiful/comments/qmklqh/oc_how_dangerous_cleaning_the_chernobyl_reactor/","name":"t3_qmklqh","ups":41528,"author":"VizzuHQ","created":"2021-11-04"},{"kind":"t3","subreddit":"anime","text":"Tax Evasion [Yama no Susume]","link":"https://www.reddit.com/r/anime/comments/qm9kji/tax_evasion_yama_no_susume/","name":"t3_qm9kji","ups":9399,"author":"Hamlock1998","created":"2021-11-04"},{"kind":"t3","subreddit":"YouShouldKnow","text":"YSK about some online legit graduate programs from accredited universities","link":"https://www.reddit.com/r/YouShouldKnow/comments/qkcxd4/ysk_about_some_online_legit_graduate_programs/","name":"t3_qkcxd4","ups":8083,"author":"throwaway-applicant","created":"2021-11-01"},{"kind":"t3","subreddit":"Astronomy","text":"Is this… accurate??","link":"https://www.reddit.com/r/Astronomy/comments/qjl0ir/is_this_accurate/","name":"t3_qjl0ir","ups":3388,"author":"not_poppy","created":"2021-10-31"},{"kind":"t3","subreddit":"goodanimemes","text":"Yup we're doomed","link":"https://www.reddit.com/r/goodanimemes/comments/qiz1ar/yup_were_doomed/","name":"t3_qiz1ar","ups":4143,"author":"creedroyce","created":"2021-10-30"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: You can copy (Ctrl + C) and paste (Ctrl + V) more than one thing at a time. Pressing Ctrl + Windows Key opens up the clipboard and allows you to paste recently copied text. You can even pin entries.","link":"https://www.reddit.com/r/LifeProTips/comments/qiwr77/lpt_you_can_copy_ctrl_c_and_paste_ctrl_v_more/","name":"t3_qiwr77","ups":928,"author":"blazingdisciple","created":"2021-10-30"},{"kind":"t3","subreddit":"explainlikeimfive","text":"ELI5 Is there a reason that some languages sound extremely fast when spoken by native speakers? It seems like the conversation goes a mile a minute. (Compared to the speed of English)","link":"https://www.reddit.com/r/explainlikeimfive/comments/qil3vh/eli5_is_there_a_reason_that_some_languages_sound/","name":"t3_qil3vh","ups":3817,"author":"WeldinMike27","created":"2021-10-29"},{"kind":"t3","subreddit":"HermanCainAward","text":"Well this one was… interesting. Wonder if their friends and family took their advice?","link":"https://www.reddit.com/r/HermanCainAward/comments/qi45ma/well_this_one_was_interesting_wonder_if_their/","name":"t3_qi45ma","ups":4555,"author":"Guilty-Affect6941","created":"2021-10-29"},{"kind":"t3","subreddit":"Infographics","text":"99% of stars you can see with naked eye are inside this circle","link":"https://www.reddit.com/r/Infographics/comments/qh0wlr/99_of_stars_you_can_see_with_naked_eye_are_inside/","name":"t3_qh0wlr","ups":510,"author":"thegreatall","created":"2021-10-27"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: Use the Clock Method to easily estimate miles in kilometers - picture a clock face, if the minutes are the miles, the % full will estimate the kilometers. (45 minutes is 75% full -&gt; 45mi is roughly 75 km)","link":"https://www.reddit.com/r/LifeProTips/comments/qgg58k/lpt_use_the_clock_method_to_easily_estimate_miles/","name":"t3_qgg58k","ups":5461,"author":"CalmBarber","created":"2021-10-26"},{"kind":"t3","subreddit":"Infographics","text":"How to tie your shoes","link":"https://www.reddit.com/r/Infographics/comments/qfmsyl/how_to_tie_your_shoes/","name":"t3_qfmsyl","ups":223,"author":"zzzerogravity","created":"2021-10-25"},{"kind":"t3","subreddit":"anime","text":"Give this guy a medal [A Certain Scientific Railgun]","link":"https://www.reddit.com/r/anime/comments/qdebyz/give_this_guy_a_medal_a_certain_scientific_railgun/","name":"t3_qdebyz","ups":9673,"author":"fanime693","created":"2021-10-22"},{"kind":"t3","subreddit":"space","text":"The fastest-spinning white dwarf ever seen rotates once every 25 seconds","link":"https://www.reddit.com/r/space/comments/qd2sk9/the_fastestspinning_white_dwarf_ever_seen_rotates/","name":"t3_qd2sk9","ups":12888,"author":"joosth3","created":"2021-10-21"},{"kind":"t3","subreddit":"explainlikeimfive","text":"ELI5: What in your brain makes someone a night or day person?","link":"https://www.reddit.com/r/explainlikeimfive/comments/q9sy75/eli5_what_in_your_brain_makes_someone_a_night_or/","name":"t3_q9sy75","ups":199,"author":"PartyKrill","created":"2021-10-17"},{"kind":"t3","subreddit":"coolguides","text":"This over complicates it but red to red black to black/or bare metal. The order technically doesn't matter.","link":"https://www.reddit.com/r/coolguides/comments/q94sys/this_over_complicates_it_but_red_to_red_black_to/","name":"t3_q94sys","ups":9008,"author":"Quesodealer","created":"2021-10-16"},{"kind":"t3","subreddit":"cursedcomments","text":"cursed_strategy","link":"https://www.reddit.com/r/cursedcomments/comments/q80qjr/cursed_strategy/","name":"t3_q80qjr","ups":17168,"author":"AtLeastITried09","created":"2021-10-14"},{"kind":"t3","subreddit":"memes","text":"It had to be done","link":"https://www.reddit.com/r/memes/comments/q81699/it_had_to_be_done/","name":"t3_q81699","ups":20045,"author":"MicRaNoob","created":"2021-10-14"},{"kind":"t3","subreddit":"YouShouldKnow","text":"YSK these websites if you are a broke college student who doesn't want to pay huge amounts of money for your required textbooks","link":"https://www.reddit.com/r/YouShouldKnow/comments/q6kjw0/ysk_these_websites_if_you_are_a_broke_college/","name":"t3_q6kjw0","ups":10052,"author":"smarton01","created":"2021-10-12"},{"kind":"t3","subreddit":"coolguides","text":"Signs of burnout","link":"https://www.reddit.com/r/coolguides/comments/q4unkp/signs_of_burnout/","name":"t3_q4unkp","ups":18182,"author":"regian24","created":"2021-10-09"},{"kind":"t3","subreddit":"dataisbeautiful","text":"Twitch revenue by user [OC]","link":"https://www.reddit.com/r/dataisbeautiful/comments/q509ir/twitch_revenue_by_user_oc/","name":"t3_q509ir","ups":10943,"author":"wallace_wells","created":"2021-10-10"},{"kind":"t3","subreddit":"AskReddit","text":"What phrase do you absolutely hate?","link":"https://www.reddit.com/r/AskReddit/comments/q3z0v2/what_phrase_do_you_absolutely_hate/","name":"t3_q3z0v2","ups":34996,"author":"RefinedStrategist","created":"2021-10-08"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: If you start a new job, and it’s slower or not what you expect, for the love of God, keep it to yourself and don’t tell your boss/temp agency/HR","link":"https://www.reddit.com/r/LifeProTips/comments/q45gdn/lpt_if_you_start_a_new_job_and_its_slower_or_not/","name":"t3_q45gdn","ups":35758,"author":"UBetcha84","created":"2021-10-08"},{"kind":"t3","subreddit":"YouShouldKnow","text":"YSK: There's a website that allows you to move playlists from one platform to another--or convert those playlists to txt or csv","link":"https://www.reddit.com/r/YouShouldKnow/comments/q3ptes/ysk_theres_a_website_that_allows_you_to_move/","name":"t3_q3ptes","ups":4364,"author":"kiloheavy","created":"2021-10-08"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: Financial illiteracy is a disease you probably won't notice you have until it's too late","link":"https://www.reddit.com/r/LifeProTips/comments/q3v92p/lpt_financial_illiteracy_is_a_disease_you/","name":"t3_q3v92p","ups":33429,"author":"definitelyged","created":"2021-10-08"},{"kind":"t3","subreddit":"AskReddit","text":"What useful unknown website do you wish more people knew about?","link":"https://www.reddit.com/r/AskReddit/comments/q2viki/what_useful_unknown_website_do_you_wish_more/","name":"t3_q2viki","ups":60274,"author":"SauloJr","created":"2021-10-06"},{"kind":"t3","subreddit":"dataisbeautiful","text":"[OC] How probable is ......?","link":"https://www.reddit.com/r/dataisbeautiful/comments/q36md2/oc_how_probable_is/","name":"t3_q36md2","ups":47791,"author":"GradientMetrics","created":"2021-10-07"},{"kind":"t3","subreddit":"programming","text":"Twitch.tv got leaked. Like, the entire website; Source code with comments for the website and various console/phone versions, references to an unreleased steam competitor, payouts, encrypted passwords that kinda thing.","link":"https://www.reddit.com/r/programming/comments/q2gz8f/twitchtv_got_leaked_like_the_entire_website/","name":"t3_q2gz8f","ups":6307,"author":"HorusGoul","created":"2021-10-06"},{"kind":"t3","subreddit":"LivestreamFail","text":"\"Twitch.tv got leaked. Like, the entire website; Source code with comments for the website and various console/phone versions, refrences to an unreleased steam competitor, payouts, encrypted passwords that kinda thing. Might wana change your passwords.\"","link":"https://www.reddit.com/r/LivestreamFail/comments/q2gooi/twitchtv_got_leaked_like_the_entire_website/","name":"t3_q2gooi","ups":64095,"author":"error521","created":"2021-10-06"},{"kind":"t3","subreddit":"AskReddit","text":"What’s the easiest way to ruin your life in your opinion?","link":"https://www.reddit.com/r/AskReddit/comments/q0y47l/whats_the_easiest_way_to_ruin_your_life_in_your/","name":"t3_q0y47l","ups":32928,"author":"sdijcf","created":"2021-10-04"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: Invest the money in an electric toothbrush. They clean WAY better than you ever could with a manual one. Your future self will thank you.","link":"https://www.reddit.com/r/LifeProTips/comments/pyo90e/lpt_invest_the_money_in_an_electric_toothbrush/","name":"t3_pyo90e","ups":6366,"author":"sippingsauce","created":"2021-09-30"},{"kind":"t3","subreddit":"YouShouldKnow","text":"YSK: Assume that the company you work for can see (and hear!) everything you do when you WFH.","link":"https://www.reddit.com/r/YouShouldKnow/comments/pxtjse/ysk_assume_that_the_company_you_work_for_can_see/","name":"t3_pxtjse","ups":17826,"author":"Bovinius__Cudd","created":"2021-09-29"},{"kind":"t3","subreddit":"AskReddit","text":"What do you do to escape reality?","link":"https://www.reddit.com/r/AskReddit/comments/px4vhc/what_do_you_do_to_escape_reality/","name":"t3_px4vhc","ups":42376,"author":"Lego8945","created":"2021-09-28"},{"kind":"t3","subreddit":"space","text":"Formation of a planetary ring (SPH simulation)","link":"https://www.reddit.com/r/space/comments/pvwbqc/formation_of_a_planetary_ring_sph_simulation/","name":"t3_pvwbqc","ups":53140,"author":"opensph","created":"2021-09-26"},{"kind":"t3","subreddit":"explainlikeimfive","text":"ELI5: What is the Fermi Paradox?","link":"https://www.reddit.com/r/explainlikeimfive/comments/pss17j/eli5_what_is_the_fermi_paradox/","name":"t3_pss17j","ups":7014,"author":"Rinsetheplates_first","created":"2021-09-21"},{"kind":"t3","subreddit":"dadjokes","text":"Do you know what the F in “orphan” stands for?","link":"https://www.reddit.com/r/dadjokes/comments/pqywfs/do_you_know_what_the_f_in_orphan_stands_for/","name":"t3_pqywfs","ups":5153,"author":"LOVERB0Y710","created":"2021-09-19"},{"kind":"t3","subreddit":"Astronomy","text":"I have designed this constellations map because I could not find any with so much information.","link":"https://www.reddit.com/r/Astronomy/comments/pq5xac/i_have_designed_this_constellations_map_because_i/","name":"t3_pq5xac","ups":4128,"author":"KrisArdrey","created":"2021-09-17"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: The more items on a restaurant menu, the less fresh the food usually is going to be.","link":"https://www.reddit.com/r/LifeProTips/comments/pjee5b/lpt_the_more_items_on_a_restaurant_menu_the_less/","name":"t3_pjee5b","ups":39634,"author":"yeetusyeetus69420","created":"2021-09-07"},{"kind":"t3","subreddit":"coolguides","text":"40 tourist scams to avoid","link":"https://www.reddit.com/r/coolguides/comments/pibnth/40_tourist_scams_to_avoid/","name":"t3_pibnth","ups":27167,"author":"regian24","created":"2021-09-05"},{"kind":"t3","subreddit":"dataisbeautiful","text":"[OC] China's energy mix vs. the G7","link":"https://www.reddit.com/r/dataisbeautiful/comments/pgglqi/oc_chinas_energy_mix_vs_the_g7/","name":"t3_pgglqi","ups":16878,"author":"jcceagle","created":"2021-09-02"},{"kind":"t3","subreddit":"InternetIsBeautiful","text":"I've made 350+ high-quality single &amp; multi-color illustrations, totally free. Will continue to add a new one each day. Use it anywhere without attribution.","link":"https://www.reddit.com/r/InternetIsBeautiful/comments/pf64di/ive_made_350_highquality_single_multicolor/","name":"t3_pf64di","ups":8191,"author":"karthiksri91","created":"2021-08-31"},{"kind":"t3","subreddit":"wholesomeyuri","text":"Kiss and Run [Magical Girl Lyrical Nanoha]","link":"https://www.reddit.com/r/wholesomeyuri/comments/pfeu5s/kiss_and_run_magical_girl_lyrical_nanoha/","name":"t3_pfeu5s","ups":2942,"author":"NekoWafers","created":"2021-08-31"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: A simple way to teach kids the difference between \"good secrets\" and \"bad secrets\" is that good secrets always have an end date (Christmas gift, surprise party, etc.) whereas bad secrets are told to be kept forever (sexual abuse, etc.).","link":"https://www.reddit.com/r/LifeProTips/comments/pf784z/lpt_a_simple_way_to_teach_kids_the_difference/","name":"t3_pf784z","ups":46029,"author":"WakeMeUpBeforeUCoco","created":"2021-08-31"},{"kind":"t3","subreddit":"anime","text":"The most disturbing anime scene I’ve ever watched [Kara no Kyoukai 5: Paradox Spirale]","link":"https://www.reddit.com/r/anime/comments/pehcu4/the_most_disturbing_anime_scene_ive_ever_watched/","name":"t3_pehcu4","ups":5589,"author":"Artyom_9","created":"2021-08-30"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: Don't throw out your burnt pot. Boil water with laundry detergent in it. That will loosen the crust and you simply wipe it off after.","link":"https://www.reddit.com/r/LifeProTips/comments/pbxf87/lpt_dont_throw_out_your_burnt_pot_boil_water_with/","name":"t3_pbxf87","ups":3113,"author":"ForSailor","created":"2021-08-26"},{"kind":"t3","subreddit":"coolguides","text":"Percentage of circumcised penises around the world","link":"https://www.reddit.com/r/coolguides/comments/pa9f96/percentage_of_circumcised_penises_around_the_world/","name":"t3_pa9f96","ups":146,"author":"It_Is_Me_The_E","created":"2021-08-23"},{"kind":"t3","subreddit":"coolguides","text":"PSA: STOP OVER SHARING this is for everyone no matter gender. Protect yourselves out there","link":"https://www.reddit.com/r/coolguides/comments/p6jgrs/psa_stop_over_sharing_this_is_for_everyone_no/","name":"t3_p6jgrs","ups":7931,"author":"americanl0ser","created":"2021-08-18"},{"kind":"t3","subreddit":"coolguides","text":"Try this technique next time you feel stressed or anxious","link":"https://www.reddit.com/r/coolguides/comments/pb8ax7/try_this_technique_next_time_you_feel_stressed_or/","name":"t3_pb8ax7","ups":5479,"author":"[deleted]","created":"2021-08-25"},{"kind":"t3","subreddit":"explainlikeimfive","text":"ELI5: Why can't you invent an imaginary number for division by zero like you can for a square root of a negative?","link":"https://www.reddit.com/r/explainlikeimfive/comments/pbejs5/eli5_why_cant_you_invent_an_imaginary_number_for/","name":"t3_pbejs5","ups":1327,"author":"dvorahtheexplorer","created":"2021-08-25"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: if your flight is cancelled while at the gate, call the airline's customer service line while you, and everyone else, head for the next available employee who can rebook you.","link":"https://www.reddit.com/r/LifeProTips/comments/palkfi/lpt_if_your_flight_is_cancelled_while_at_the_gate/","name":"t3_palkfi","ups":75,"author":"lavos__spawn","created":"2021-08-24"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: When chopping food, turn the knife over and use the dull edge when pushing food off your cutting board into your pot/pan etc. It will keep the sharp edge sharp for significantly longer.","link":"https://www.reddit.com/r/LifeProTips/comments/p7mxhm/lpt_when_chopping_food_turn_the_knife_over_and/","name":"t3_p7mxhm","ups":27235,"author":"sycohozbst","created":"2021-08-19"},{"kind":"t3","subreddit":"Showerthoughts","text":"Passwords have probably stopped more people getting into their own account than hackers.","link":"https://www.reddit.com/r/Showerthoughts/comments/p3qak1/passwords_have_probably_stopped_more_people/","name":"t3_p3qak1","ups":25546,"author":"Michaelrosenisurdad","created":"2021-08-13"},{"kind":"t3","subreddit":"space","text":"Which is the most disturbing fermi paradox solution and why?","link":"https://www.reddit.com/r/space/comments/p2xd1q/which_is_the_most_disturbing_fermi_paradox/","name":"t3_p2xd1q","ups":25177,"author":"IceNox96","created":"2021-08-12"},{"kind":"t3","subreddit":"explainlikeimfive","text":"ELI5: when a person is dehydrated and starts drinking water, how does the redistribution process work? Do the most essential parts get filled to “100%” (to use a battery analogy) or just enough to get out of the danger zone and then hydrate less essential parts of the body?","link":"https://www.reddit.com/r/explainlikeimfive/comments/p2cb75/eli5_when_a_person_is_dehydrated_and_starts/","name":"t3_p2cb75","ups":10834,"author":"Mindless-Bowler","created":"2021-08-11"},{"kind":"t3","subreddit":"dataisbeautiful","text":"[OC] Are we workign less but earning m","link":"https://www.reddit.com/r/dataisbeautiful/comments/p1pnzp/oc_are_we_workign_less_but_earning_m/","name":"t3_p1pnzp","ups":6156,"author":"jcceagle","created":"2021-08-10"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: Once someone threatens to sue you you should stop all contact, don't respond to them in anger or to apologize, if they continue to contact you, only say that since they have threatened legal action you can no longer speak to them except though an attorney.","link":"https://www.reddit.com/r/LifeProTips/comments/p0rpi7/lpt_once_someone_threatens_to_sue_you_you_should/","name":"t3_p0rpi7","ups":34917,"author":"ABiologicalEntity","created":"2021-08-09"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT All young people entering the workforce for the first time: HR DOES NOT HAVE YOUR BEST INTEREST IN MIND","link":"https://www.reddit.com/r/LifeProTips/comments/p0a43w/lpt_all_young_people_entering_the_workforce_for/","name":"t3_p0a43w","ups":34669,"author":"knabe4k","created":"2021-08-08"},{"kind":"t3","subreddit":"Astronomy","text":"I want to get into Astronomy.","link":"https://www.reddit.com/r/Astronomy/comments/oziwaz/i_want_to_get_into_astronomy/","name":"t3_oziwaz","ups":9,"author":"wcollier333","created":"2021-08-07"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT- if you're in a discussion/argument with someone and they insult your appearance or character, it's time to stop investing energy in the conversation.","link":"https://www.reddit.com/r/LifeProTips/comments/oydvdq/lpt_if_youre_in_a_discussionargument_with_someone/","name":"t3_oydvdq","ups":28922,"author":"tittyswan","created":"2021-08-05"},{"kind":"t3","subreddit":"anime","text":"Whats a anime that reasonable popular that died off quietly?","link":"https://www.reddit.com/r/anime/comments/oya9nj/whats_a_anime_that_reasonable_popular_that_died/","name":"t3_oya9nj","ups":131,"author":"BattleShonen7","created":"2021-08-05"},{"kind":"t3","subreddit":"anime","text":"What anime rated less than 7 on MAL or anilist did you really like?","link":"https://www.reddit.com/r/anime/comments/ow0fi3/what_anime_rated_less_than_7_on_mal_or_anilist/","name":"t3_ow0fi3","ups":25,"author":"kurruchi","created":"2021-08-01"},{"kind":"t3","subreddit":"cursedcomments","text":"Cursed beat up","link":"https://www.reddit.com/r/cursedcomments/comments/ouevzt/cursed_beat_up/","name":"t3_ouevzt","ups":14091,"author":"Nakatita","created":"2021-07-30"},{"kind":"t3","subreddit":"LearnJapanese","text":"Why can you conjugate adjectives? I can’t see a situation where you would use the past tense of pretty","link":"https://www.reddit.com/r/LearnJapanese/comments/8eom30/why_can_you_conjugate_adjectives_i_cant_see_a/","name":"t3_8eom30","ups":0,"author":"skwishy29","created":"2018-04-24"},{"kind":"t3","subreddit":"space","text":"The Whirlpool Galaxy: My image Compared to Hubble's","link":"https://www.reddit.com/r/space/comments/or121k/the_whirlpool_galaxy_my_image_compared_to_hubbles/","name":"t3_or121k","ups":63089,"author":"azzkicker7283","created":"2021-07-25"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: Drop a raw egg? Don't want to chase it around on the counter or floor trying to clean it up? Sprinkle it with enough table salt to get it to congeal, then easily scoop it up with a paper towel or napkin.","link":"https://www.reddit.com/r/LifeProTips/comments/okt5mg/lpt_drop_a_raw_egg_dont_want_to_chase_it_around/","name":"t3_okt5mg","ups":138,"author":"GArockcrawler","created":"2021-07-15"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: Roll an orange on a hard surface before you peel it. The white flesh will separate from the actual fruit and so it’s easier to peel.","link":"https://www.reddit.com/r/LifeProTips/comments/okia5u/lpt_roll_an_orange_on_a_hard_surface_before_you/","name":"t3_okia5u","ups":2590,"author":"imccauley0819","created":"2021-07-15"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: Job descriptions are usually written to sound more complicated and high profile than the jobs really are. Don’t let the way it is written intimidate or deter you from applying to a job you think you can do.","link":"https://www.reddit.com/r/LifeProTips/comments/ok31fs/lpt_job_descriptions_are_usually_written_to_sound/","name":"t3_ok31fs","ups":56420,"author":"RoseyPosey30","created":"2021-07-14"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: If you make a comment/post that you regret, edit it to remove all the info before you delete it. Reddit never deletes comments, but they only store the latest revision.","link":"https://www.reddit.com/r/LifeProTips/comments/1dig53/lpt_if_you_make_a_commentpost_that_you_regret/","name":"t3_1dig53","ups":136,"author":"nagasgura","created":"2013-05-01"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: When deleting a comment on Reddit, it can still be accessed by anyone from removeddit.com and other sites. To bypass this just edit the comment before deleting it and replace it with \"\\-\" so now whenever someone looks at your deleted comment, all they'll see is a dash.","link":"https://www.reddit.com/r/LifeProTips/comments/oizyra/lpt_when_deleting_a_comment_on_reddit_it_can/","name":"t3_oizyra","ups":16020,"author":"[deleted]","created":"2021-07-12"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: You can add dots anywhere to your gmail address and it will still deliver it to you. You can use this to create multiple accounts on other websites that will still link to your same gmail address.","link":"https://www.reddit.com/r/LifeProTips/comments/ohmrj3/lpt_you_can_add_dots_anywhere_to_your_gmail/","name":"t3_ohmrj3","ups":29935,"author":"break_me_down","created":"2021-07-10"},{"kind":"t3","subreddit":"LifeProTips","text":"LPT: Be SUPER CAREFUL about how you speak to yourself. Here’s why.","link":"https://www.reddit.com/r/LifeProTips/comments/ocoygy/lpt_be_super_careful_about_how_you_speak_to/","name":"t3_ocoygy","ups":36208,"author":"dylangrae","created":"2021-07-03"}]}