{"saves":[{"kind":"t3","subreddit":"BlueArchive","title":"Some students who have appeared as NPCs / enemies but are not yet playable","body":"","link":"https://www.reddit.com/r/BlueArchive/comments/skccs2/some_students_who_have_appeared_as_npcs_enemies/","name":"t3_skccs2","ups":683,"author":"twoduy","created":"2022-02-04T12:40:35.000Z"},{"kind":"t3","subreddit":"BlueArchive","title":"The Biblical References of Blue Archive","body":"So, cute game with lots of casual crime. That's Blue Archive. But after giggling like a child at \"Shittim Chest\" for the umpteenth time during my many rerolls, I got curious if \"Shittim\" was an actual thing. This lead me down a rabbit hole to an eventual conclusion; Blue Archive's world is heavily inspired by the Bible.\n\nNow, this might be obvious, given that this is a world where all the girls have halos, but the references could end up being significant, so I thought I would list all the ones I've found here and let people fill in the gaps.\n\nStarting with the first thing we see in the game;\n\n*\"'We thirst for the Seven Wailings,*  \n*We bear the Koan of Jericho.'*  \nWelcome to the Shittim Chest, Sensei.\"\n\nWhile Shittim is an admittedly funny word, up there with Eligma, it's also a real thing. Shittim, singular Shittah, refers to the wood of an Acaciah Tree. While this may not seem like much, it's actually an extremely important clue to what the significance of our tablet is.\n\nThe Ark of the Covenant, the sacred relic which contained the Ten Commandments, was made out of Acacia wood (before being coated in gold). It's even more reasonable to believe that the Shittim Chest is the Arc of the Covenant when we consider the context this provides to the password.\n\nDuring the Battle of Jericho, the Ark of the Covenant was carried around the walls of Jericho for 6 days, surrounded by 7 priests blowing trumpets. On the seventh day, having gone around the city seven times, the seven priests sounding the seven trumpets, the walls of Jericho fell.\n\nWith this context in mind, the lines, \"We bear the Koan of Jericho\" and \"We thirst for the Seven Wailings\" make a lot more sense. This makes the nature of the tablet more apparent, but raises more questions than it answers. There's a joke to be made here about how the Ark of the Covenant contained tablets, I'm sure.\n\nTo start, what of the AI inside the tablet? Well, if you thought Arona was a Japanese name, you'd be forgiven. But it's actually a Hebrew name in origin. Arona is the female form of Aaron, and if we look at the biblical context, Aaron was a prophet and the brother and assistant of Moses. If Arona is meant to be our Prophet, then our role in leading the masses (students) to a better life could make us something of a Moses figure. Food for thought.\n\nThis leads into the nature of Kivotos itself. While this reference is a bit more out there, Kivotos is a Greek word, and if you think it being Greek makes a Biblical connection less likely, \"Kivotos\" means \"Ark.\"\n\nI don't believe Kivotos is also referring to the Ark of the Covenant. Rather, Kivotos is used in the phrase, \"kivotós tou Nóe,\" or Noah's Ark. Rather than a literal meaning, I believe that this is meant to allude to the idea that Kivotos is a last bastion for the students, a place meant for surviving a great catastrophe. This could relate to why the world outside of Kivotos seems barren.\n\nThere's also the matter of Decagrammaton. I wont go too deep into this one, mostly because I only know of it from an interview with the scenario writer. However, the first Raid Boss is related to Decagrammaton; it's a gigantic worm creature with a halo, named Binah. Halos seem to be special features in Blue Archive, Sensei and non-Students dont have one. Decagrammaton is one of the Hebrew names of God, specifically, it's comprised of the first three names of the Sephirot; Keter, Chockmah, and Binah, the Sephirot themselves being manifestations of said God. See the name of the raid boss for that last one.\n\nFinally, the title of the game itself could have a deeper meaning. This one is a bit of a stretch and isn't a Biblical reference, but I thought it would be worth mentioning. I believe that Blue Archive may be referring to the Akashic Records. The Akashic Records are a theoretical compendium, from Theosophy, of all knowledge, past, present, and future, and \"Akasha\" is the Sanskrit word for Sky. A Blue Archive, if you will. But that's the most crack this pot has gotten.\n\n~~And before you ask, no, Eligma doesn't mean anything. Not as far as I can tell.~~ After doing some research, I believe Eligma is a Greek word in origin, \"ελιγμα.\" In this case, it likely means \"roll,\" referring to when Jesus is buried with, \"a mixture of myrrh and aloes.\"","link":"https://www.reddit.com/r/BlueArchive/comments/qu2h3p/the_biblical_references_of_blue_archive/","name":"t3_qu2h3p","ups":743,"author":"KrizzleWizzle","created":"2021-11-14T23:30:50.000Z"},{"kind":"t1","subreddit":"BlueArchive","body":"If the effect comes from the same type of skill, then it doesn't stack. If it comes from different skill types, then it will.\n\nE.g. Hibiki's subskill grants crit damage. Hanae's subskill also grants crit damage. Both will not stack. If I'm not wrong, the skill with the highest % takes precedence over the lower one.\n\nE.g. Azusa's normal skill decreases DEF. Akane's EX skill decreases DEF. These will stack.","link":"https://www.reddit.com/r/BlueArchive/comments/sj44f4/daily_questions_megathread_february_03_2022/hvdkr4w/","name":"t1_hvdkr4w","ups":10,"author":"MelforceX","created":"2022-02-03T04:12:52.000Z"},{"kind":"t1","subreddit":"BlueArchive","body":"Right.\n\n* EX: Akane\n* Normal: Azusa, Maki\n* Sub: S.Azusa\n\nEach unique source stacks with one another, but those within a single category don’t.","link":"https://www.reddit.com/r/BlueArchive/comments/sgmr22/daily_questions_megathread_january_31_2022/hv0vsc1/","name":"t1_hv0vsc1","ups":5,"author":"LostRequiem1","created":"2022-01-31T18:21:08.000Z"},{"kind":"t1","subreddit":"BlueArchive","body":"Don’t worry her summer version is used in end game stuff","link":"https://www.reddit.com/r/BlueArchive/comments/sfn8vm/sensei_wants_to_spoil_hina_by_koi000/hutf0g2/","name":"t1_hutf0g2","ups":3,"author":"kidsparks","created":"2022-01-30T05:16:18.000Z"},{"kind":"t3","subreddit":"BlueArchive","title":"For people who didn't get / didn't pull / skipped / Azusa. Here's some news","body":"Azusa will be farmable though raid shop in the future.  \nThe downside is that you'll have to wait until Insane Raids comes to Global  \nDisclaimers:  \n*\\*information is still subject to change*  \n*\\*information was gathered from a discord server*\n\n\\-----------//-----------\n\n**Rank Rewards after Raid:**  \nPlatinum Rank: 300 Rare Coin  \nGold Rank: 250 Rare Coin  \nSilver Rank: 200 Rare Coin  \nBronze Rank: 150 Rare Coin\n\n**Rewards for clearing specific Raid difficulties:**  \nHardcore: 10 Rare Coin  \nExtreme: 20 Rare Coin  \nInsane: 40 Rare Coin  \n\n\n|Rare Coin Cost|Item|Limit|\n|:-|:-|:-|\n|50|5x Azusa Shards|5|\n|500|Ultimate Skill Book|1|\n|10|1x Beginner Tactical Training Blu-ray|10|\n|20|1x Normal Tactical Training Blu-ray|8|\n|50|1x Advanced Tactical Training Blu-ray|6|\n|100|1x Superior Tactical Training Blu-ray|2|\n|3|1x Beginner Tech Notes|13|\n|5|1x Normal Tech Notes|10|\n|10|1x Advanced Tech Notes|8|\n|25|1x Superior Tech Notes|5|\n\nSpeculation calculations:\n\nLets say that you only do **Hardcore only**   \nand Raids last for 1 week  \n*\\[skip day 1 since you can clear up to Very Hard difficulty\\] (that leaves you 6 days to farm coins)*  \nYou'll be getting: 180 coins  \nNormally players will sit around silver and gold after the raid= 200 / 250\n\n\\[Rare Coins gain\\]\n\nSilver = 380  \nGold = 430\n\n\\[Rare Coins exchange for Azusa\\]\n\nSilver = 25x Azusa shards (130 Rare coins to spare)  \nGold = 25x Azusa shards (180 Rare coins to spare)  \nTo unlock a new student using shards you'll need 120 shards  \nSo in 5 raid resets you can unlock Azusa\n\nEdit1(some info):\n\n* Leaked img. of the [Rare Coin](https://cdn.discordapp.com/attachments/906611057945104424/936247483284226098/image0-2.jpg)\n* About the source. The informant said that it was from a JP dev blog / wiki / someone that they know leaked it. I assume for safety reasons they don't want to share the link for the info.\n\nEdit 2:  \n\\*fixed the math\\*  \n\\-the rare coin gains were wrong but you'll still be able to get it all if you do the minimum difficulty (Hardcore)  \n\\-credit to  [**\\_163**](https://www.reddit.com/user/_163/) for pointing out the math error","link":"https://www.reddit.com/r/BlueArchive/comments/sdbi3q/for_people_who_didnt_get_didnt_pull_skipped_azusa/","name":"t3_sdbi3q","ups":60,"author":"MarukoAizawa","created":"2022-01-26T17:36:09.000Z"},{"kind":"t1","subreddit":"BlueArchive","body":"is https://bluearchive.wiki/wiki/Equipment accurate? for example it says the furthest right has the highest drop rate but lists 14-5 as the highest drop for t5 hairpins. and is 13-4 and 14-2 equally the highest droprate for t5 hairpins?","link":"https://www.reddit.com/r/BlueArchive/comments/sdkc7b/daily_questions_megathread_january_27_2022/hueswzr/","name":"t1_hueswzr","ups":1,"author":"pranho","created":"2022-01-27T07:10:48.000Z"},{"kind":"t1","subreddit":"BlueArchive","body":"https://docs.google.com/spreadsheets/d/e/2PACX-1vT-shW_IH3XVGR2BE8oBBR_dDASejAk1EhrZjRPpA7CnO1DNgvB6Bd6KT7kGbK5ZkR0H9Yyak6V-8Iv/pubhtml# just plan your pulls from this info.","link":"https://www.reddit.com/r/BlueArchive/comments/s7pbye/time_to_sack_our_luck_for_azusa/htcc26p/","name":"t1_htcc26p","ups":5,"author":"Fujin166","created":"2022-01-19T17:29:56.000Z"},{"kind":"t3","subreddit":"BlueArchive","title":"Recommended Pick-up Banners (1/2)","body":"This is a translated article that originally created by a Korean player of Blue Archive.\n\nIf you look around global server for a bit, you can see there is bunch of people who don't even know how they will plan for the future banners.\n\nThis is personal advice for them and I will explain which character gacha is worth to aim for.\n\n&amp;#x200B;\n\nIf you wanna see the original post, please check [https://arca.live/b/bluearchive/38818620?mode=best&amp;target](https://arca.live/b/bluearchive/38818620?mode=best%E2%8C%96%22)\n\nYou can also see this post at : [https://arca.live/b/bluearchive/38936819?target=all&amp;keyword](https://arca.live/b/bluearchive/38936819?target=all&amp;keyword) I prefer the format in the link personally.\n\nThe contents will be continued on the next post, because of the picture limit.\n\nYou can see the next post at : [https://www.reddit.com/r/BlueArchive/comments/r0qk22/recommended\\_pickup\\_banners\\_22/](https://www.reddit.com/r/BlueArchive/comments/r0qk22/recommended_pickup_banners_22/)\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Table of Contents\n\n1. **Recommended Regular Character Pick-up Banner**\n2. **Essential Regular Character Pick-up Banner**\n3. **Recommended Limited Character Pick-up Banner**\n4. **Essential Limited Character Pick-up Banner**\n5. **Waifu Pick-up Banner (pull her if she is your waifu)**\n6. **Do not recommend to pull**\n7. **Summary**\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nIf you really want to achieve the maximum efficiency, try only **2. Essential Regular Character Pick-up Banner** and **4**. **Essential Limited Character Pick-up Banner**.\n\nIf you don't have enough time to read, see the **7. summary** in the next post\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# 1. Recommended Regular Character Pick-up Banner\n\n&amp;#x200B;\n\nhttps://preview.redd.it/z1abr2lnif181.png?width=252&amp;format=png&amp;auto=webp&amp;s=786d38772ee7184d3346840385920a9d1f49e9d1\n\n★3 Midori (Striker/Piercing)\n\nHer EX Skill fires 5 separate bullets to enemies.\n\nIf there is only one target, all five shots will hit that target and the damage is pretty sexy as accumulative.\n\nShe is good at Piercing Total Assault such Chesed, but if you can't afford for her, personally I think it's more efficient to pull only the two star character Momoi, who is her older sister, and pull Cherino instead. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/lp6vy8bpif181.png?width=252&amp;format=png&amp;auto=webp&amp;s=8efaec0bd12178d5479bb54c6a04bb66c747e5e6\n\n★3 Cherino (Striker/Piercing)\n\nHer EX Skill is a wide AOE damage covering the entire map, and it's gas.\n\nIn particular, she is good at Chesed and she is used at pretty much any maps require Piercing damage.\n\nIn addition, her Sub Skill is increasing the cost recovery rate, and you can feel it when you put her in your party.\n\nCherino's Ex skill can feel heavy, which costs 7, and costs 5 at level 5, and this could be covered by her Sub Skill.\n\nAbove all, she's CUTE\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/suvwbrdqif181.png?width=252&amp;format=png&amp;auto=webp&amp;s=5bfd431c899a36c94fb0d3886332068f23b39122\n\n★3 Bunny Girl ver. Asuna (Striker/Mystic)\n\nHer Ex Skill decreases DEF of enemies within a circle. You might be noticed something through the first Total Assault, that Decreasing enemies' DEF is so crucial in this game.\n\nHowever, since her skill is AOE, her debuff rate is lower than Akane's, and cost is little higher than her, which costs 5. \n\nSince she is a DEF debuffer in Mystic type, I recommend to pull her if you can afford.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/4hv2lgorif181.png?width=252&amp;format=png&amp;auto=webp&amp;s=dbe34ea6b3530130fee599dd4bc26664a1f7219e\n\n★3  Natsu (Striker/Mystic)\n\nHer EX Skill heals herself and removes one debuff on her.\n\nBecause of this, she is useful at a Mystic Total Assault, Perorodzilla, which will be released later.\n\nHer Basic Skill throws a pie to her allies behind and this increases their ATK.\n\nHer Sub Skill increases the amount of healing she receives each time she use EX Skill, and this can be stacked up to 3 times.\n\nThe longer the battle, the greater heal she receives.\n\nShe is the only tank that can buff allies, so she has some advantages.\n\nI recommend to take her if you can afford.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# 2. Essential Regular Character Pick-up Banner\n\n&amp;#x200B;\n\nhttps://preview.redd.it/844rib4uif181.png?width=252&amp;format=png&amp;auto=webp&amp;s=8fcbe45f0dc99ef29931fa334c0a0e6f252f3855\n\n**★3 Izuna (Striker/Mystic)**\n\nHer EX Skill moves her designate location and increase her attack speed. Her Sub Skill additionally increases her ATK too. There were a lot of guys who try to skip her, but if you can afford her, I recommend to pull her.\n\nIn this game, Mystic type DPS is rare and above all, she is so necessary at Shiro &amp; Kuro Total Assault. Total Assault is not over once you've done it, but it rotates, which means you will be twisted every time Shiro &amp; Kuro Total Assault begins.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/mkw6ye1vif181.png?width=252&amp;format=png&amp;auto=webp&amp;s=aaecff4894a79f84ec37961f72a71796b2a8a818\n\n**★3 Azusa (Striker/Explosive)**\n\nSHE IS A CRAZY BITCH. PLEASE JUST PULL HER. Don't even care if she is a regular character or not.\n\nHer Basic Skill decrease the enemy's DEF and her EX Skill deals more than 2,000% of her ATK at level 5.\n\nYou can see her slicing enemies till their one last soul when she deal with Light armored enemies.\n\nSeriously, pull her, or you will regret,\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/acx5u70wif181.png?width=252&amp;format=png&amp;auto=webp&amp;s=e64d15f3bfe3d5f7cda9ae74549f93fc04e82c12\n\n**★3 Koharu (Striker/Explosive)**\n\nCRAZY BITCH No. 2. PLEASE JUST PULL HER.\n\nShe is a striker that has both single target heal and AOE heal, also the amount of healing is fucked up.\n\nIt will be decided whether you will need to use only one party or two parties in Total Assault.\n\nIf you have Koharu, you can use HIbiki and Kotama on Special without Serina or other healers.\n\nJust fucking pull her.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/oj75x15yif181.png?width=252&amp;format=png&amp;auto=webp&amp;s=3f78d18f8912a4fbba7ae0031bb7869e7aebb196\n\n**★3 Hibiki (Special/Explosive)**\n\nWe don't even need an explanation here.\n\nI believe there is no guy who started the game without her, but I'm saying this in case there is, pull her whatever you do if you don't own her. \n\nHer Sub Skill increases all allies' Crit Damage and her EX Skill spams 5 bombs in wide AOE and it only costs 4. She is literally a crazy bitch\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# 3. Recommended Limited Character Pick-up Banner\n\n&amp;#x200B;\n\nhttps://preview.redd.it/nyt20nnzif181.png?width=252&amp;format=png&amp;auto=webp&amp;s=96f7330b21375c7b3b86aa47b9bb714f1356adc9\n\n★3 Bunny Girl ver. Neru (Striker/Explosive)\n\nHer EX Skill is charging toward designated direction and getting a shield.\n\nShe is a very good tanker because EX Skills that you can adjust the location of students or avoid the boss's attack are more valuable in the later game.\n\nShe also has decent damage, and her EX Skill will taunts the enemy at level 3, so you can protect other students. \n\nHowever she is a tank with low HP but high Evasion, so you might feel her tanking is not enough, If you can afford her, I recommend to pull her.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/so3tzqx0jf181.png?width=252&amp;format=png&amp;auto=webp&amp;s=6b1231e85c3567729f68e706c02dceae673125b8\n\n★3 Bunny Girl ver. Karin (Striker/Mystic)\n\nHer EX Skill deals AOE damage in a fan-shaped range that is wider but shorter than Hina, and this damage ignore enemy's DEF. The damage is quite strong, but the cost is also high, which costs 7. Still the more mystic DPS, the more favored, and ignoring enemy's DEF is a rare option, so I recommend to pull her if you can afford her.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/orzcdlr1jf181.png?width=252&amp;format=png&amp;auto=webp&amp;s=0115e2f34631591d22845bc343fc94cf10de8f2e\n\n★3 Swimsuit ver. Iori (Striker/Explosive)\n\nHer EX Skill strikes 3 consecutive attacks at enemies in a circle.\n\nShe deals dot damage with a debuff which is called Chill.\n\nIt's pretty powerful when it's accumulated.\n\nCompared to the other 3 swimsuits ver. students, she is less op than others.\n\nEven if you don't own her, it wouldn't make that much problems in terms of the battle, but she is still good character.\n\nSince she is a limited character, I recommend to pull her if you can afford her.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# 4. Essential Limited Character Pick-up Banner\n\n&amp;#x200B;\n\nhttps://preview.redd.it/2vo65zp3jf181.png?width=252&amp;format=png&amp;auto=webp&amp;s=184889adb219dafec52fbf6bc06f3e49e605a0ca\n\n**★3 Swimsuit ver. Azusa (Striker/Mystic)**\n\nSHE IS SIMPLY A OP AS HELL\n\nYou can think of her as changing Azusa into Mystic version as she is.\n\nYou probably get it then. She is OP. Pull her unconditionally. She is even limited character which make it worse.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/0o7jvgw5jf181.png?width=252&amp;format=png&amp;auto=webp&amp;s=a0f45065622a36acece7c8a7fb1203d8ff41ecf4\n\n**★3 Swimsuit ver. Mashiro (Special/Mystic)**\n\nOP AS HELL No. 2 (only in Tactical Challenge)\n\nHer EX Skill decreases enemy's Evasion and deals damage.\n\nHer Sub Skill increases Accuracy of allies, which means that she counters Tsubaki so hard.\n\nShe literally ends the fucking Tsubaki meta. \n\nFurthermore, she is a limited character.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/q0u659x6jf181.png?width=252&amp;format=png&amp;auto=webp&amp;s=2a880f742c95f1a0af63ac3e60171a791fafca63\n\n**★3 Swimsuit ver. Hina (Striker/Explosive)**\n\nHer EX Skill only costs 3 and deals damage up to 5 enemies in similar range of Nonomi's EX Skill\n\nShe can deal decent damage and her ATK will be increased every time she uses EX Skill up to 5 stacks.\n\nShe is one of the main reasons that prevent Shun from Tactical Challenge, and she can be used in various types of battle.\n\nOf course, she can be a bit disappointing in a boss fight with only one target or a situation that you have to finish the battle shortly, but she's is still a good student.\n\nShe is a limited character, and you might regret that you didn't get her.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# \n\n# 5. Waifu Pick-up Banner (pull her if she is your Waifu)\n\n&amp;#x200B;\n\nhttps://preview.redd.it/dbn9wnf8jf181.png?width=252&amp;format=png&amp;auto=webp&amp;s=c37d2cd368be93ad7ec4adaeefb0e90161fc5efe\n\n★3 Riding ver. Shiroko (Striker/Mystic)\n\nHer EX Skill deals AOE damage and reduces target's ATK.\n\n Her Basic skill shoots a straight-line attack like Haruna EX Skill every set time, and this has decent damage.\n\nIn fact, it is a bit vague to sue her as a main DPS, but her ATK reduction helps allies' survivability such in Shiro &amp; Kuro Total Assault.\n\nIt's good for you if you own her but it won't bother you a lot even you don't own her. She is sexy tho. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/0sdl99d9jf181.png?width=252&amp;format=png&amp;auto=webp&amp;s=91ae4a8a2a2419e846fd15bd671bf22f34612504\n\n★3 Young ver. Shun  (Striker/Explosive)\n\nHer EX Skill is a single target attack which ignores target's DEF.\n\nHer Sub Skill is kinda weird, which decreases her ATK after she uses her EX Skill for 20 second.\n\nAs soon as this debuff ends, her ATK will increased for 20 Second,\n\nThis means, after using her EX Skill, you have to wait until the debuff disappears and use the next EX Skill to maximize her damage.\n\nIf you want to use her, you can sue herm but there are a lot of good explosive DPSs so it's not really necessary.\n\nIf she is your Waifu, pull her.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/6e24wv2ajf181.png?width=252&amp;format=png&amp;auto=webp&amp;s=44e9cf4354bd7648fb84945dc9615a66715478f0\n\n★3 Hatsune Miku (Special/Explosive)\n\nHer EX Skill heals allies in a circle and gives ATK buff.\n\ncontrary to expectations that she might be OP, she is undervalued because her disappointing healing amount.\n\nI think she needs more research to use.\n\nIf she is your Waifu, pull her.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/9yhgfgjbjf181.png?width=252&amp;format=png&amp;auto=webp&amp;s=7ac5d7655a0e1782de8d9fd0170a3a80975d620f\n\n★3 Swimsuit ver. Hihumi (Special/Piercing)\n\n**Her EX Skill costs 10.**\n\nAs an exchange, she wipes out enemies with a powerful tank, and some guys used it in Chesed.\n\nI remember that is was so inefficient and didn't go that far.\n\nBesides, she is a Swimsuit ver., but she isn't limited character.\n\nPull her if she is your Waifu or you love tank, but pass this banner if you aren't.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nhttps://preview.redd.it/65u4n2gdjf181.png?width=252&amp;format=png&amp;auto=webp&amp;s=acd8e77f8a516440404d2051ea32bd9482496e74\n\n★3 Casual ver. Saya (Special/Piercing)\n\nHer EX Skill installs a poison plates that inflicts dot damage on enemies within a straight line area like Rumble's R in League of Legend.\n\nHer Basic Skill deals damage in a circular range every set of time.\n\nHer Enhanced Skill increases her Crit damage and her Sub Skill increases allies' Crit damage like Hibiki.\n\nShe is like a piercing version of Hibiki, but if you are not interested in her, you don't have to pull her.\n\nIf she is your Waifu, pull her instead.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n# Continued on the next post\n\n[https://www.reddit.com/r/BlueArchive/comments/r0qk22/recommended\\_pickup\\_banners\\_22/](https://www.reddit.com/r/BlueArchive/comments/r0qk22/recommended_pickup_banners_22/)","link":"https://www.reddit.com/r/BlueArchive/comments/r0qi91/recommended_pickup_banners_12/","name":"t3_r0qi91","ups":571,"author":"Ok-Ear-7714","created":"2021-11-23T23:35:26.000Z"},{"kind":"t3","subreddit":"BlueArchive","title":"A Dumbshits Guide to Blue Archive","body":"&gt;EDIT: Updated section about PvP. Don't rush.  \n&gt;  \n&gt;Do not overfarm Hard Chapter 1 and Chapter 2. If you have enough T1 equipment to put on each student you have, it is enough. Only starting from T2 which is Chapter 4 and on that you use equipment as blueprints to ascend each others. If you're not yet able to clear Chapter 4, farm EXP with spare stamina, and even Hard Chapter 1 and 2 for character's shards, but once able to unlock T2 equipment, focus on farming it extensively for your team, because as I said equipment will not be obtainable elsewhere and you need dozens of them just to upgrade one piece of equipment slot.  \n&gt;  \n&gt;Basically: If Chap 4 not unlocked, farm all Hard, then EXP in Commission until out of stamina. After Chap 4, farm all Hard except Chap 1 and 2, then equipment T2 and above. Prioritize EXP farm if your main team can't follow Sensei level.  \n&gt;  \n&gt;Also see comments I post below for farmable character priority and how long it takes to unlock the map for them.  \n&gt;  \n&gt;The most accurate Tier List I found (credit to NepMX on official BA discord):\n\n[https://preview.redd.it/lv6ol3pm87z71.png?width=1075&amp;format=png&amp;auto=webp&amp;s=6a427f93e38646fb686d19eaceffb12799f3624f](https://preview.redd.it/lv6ol3pm87z71.png?width=1075&amp;format=png&amp;auto=webp&amp;s=6a427f93e38646fb686d19eaceffb12799f3624f)\n\n&amp;#x200B;\n\n~~Step 1: Get Havel's Ring and Ring of Favor and Protection~~\n\nWell this is what I gathered from few months of playing on JP.\n\nFirst of all, depending how or if Nexon can make it work, your assistance Arona might be able to pronounce your name like in JP. So try to pick the name carefully, as there will be that name plus an account name for Blue Archive.\n\nLittle note for Game-Setting: JP client was very unoptimized, so the game drain battery even more than Asphalt 9. On high-end phone, just go for the highest settings, because even low settings it still drain battery all the same. Seems to improve overtime, but will have to see how Nexon will do this on launch.\n\n* **Priority:**\n\n&gt;If you just want a very shorthand version of what to do the first thing you open the game, here is a list:  \n&gt;  \n&gt;\\- Clear as far as you can on Main campaign. Don't worry about failing, they don't save it like Arknights, and there's no penalty for it like Girls' Frontline. You get 99% cost refund back if run fails.  \n&gt;  \n&gt;\\- Start pulling. Look for Shun, Iori, Haruna, and Hibiki. If not it's OK, just get a 3-star. By the time you get 3-star you should have enough for a decent team of 2-star, and you can start leveling more comfortably.  \n&gt;  \n&gt;\\- Set 2 team of at least 2 Red Striker per team, 1 Tank (Tsubaki and Yuuka), and at least 1 healer (Hanae, Serina).  \n&gt;  \n&gt;\\- Your character level limit is your Sensei level. If you want to rush content your goal is getting that Sensei level up as fast as you can. Sensei level increase at 1:1 rate with stamina spent. You can use pyroxene to recharge stamina up at cost of 30 up to 3 or 4 times. About the equivalent of a single pull, and it's very worth it in the long run.  \n&gt;  \n&gt;\\- Start gathering Exp book to level at least one or two team of Red attack type. Red is strong against Red armor and normal against Yellow armor, so they can be use for anything up to chapter 9. EXP drop from EXP domain, or can be from Starter Event rewards.  \n&gt;  \n&gt;\\- Check if you have the thing to level Dorm, which drop from first map clear of certain Campaign maps. Use it to upgrade your Dorm.  \n&gt;  \n&gt;\\- Start crafting. The nodes will be random select of 5, pick the one that produce furniture. (If not appear, pick one that produce Student Gift) (If also no gift, pick Growth Material)  \n&gt;  \n&gt;\\- Build furniture in Dorm to increase stamina output.  \n&gt;  \n&gt;\\- Check daily missions.  \n&gt;  \n&gt;\\- Hard map will have daily limit, and they give out character shards randomly. You should always clear them, especially on low level. But in case you need your stamina elsewhere, here are priority list of important characters shards and equipment that you should build to invest for endgame:  \n&gt;  \n&gt;~~Chap 1: Hard 1-2 (for Glove and Watch equipment) &gt; Hard 1-3 (for Serika shards) &gt; Hard 1-1 (Yuuka shards)~~  \n&gt;  \n&gt;~~Chap 2: Hard 2-2 (for Akari, Glove and Watch equipment) &gt; Hard 2-3 (for Junko shards) &gt; Hard 2.2 (low priority, but Hat is good)~~  \n&gt;  \n&gt;**(ONLY FARM CHAP 1 AND 2 IF YOU NEED SHARDS AND/OR NOT YET REACH CHAPTER 4)**  \n&gt;  \n&gt;Chap 3: Hard 3-3 (Shiroko) &gt; Hard 3-2 = Hard 3-1 (EX book priority depends on which 3-star you got or character you want to build)  \n&gt;  \n&gt;Chap 4: Hard 4-2 (Pina, Glove, Watch Tier 1) &gt; Hard 4-1 (Asuna, Shoe) &gt; Hard 4-3 (Yuuka, Hat)  \n&gt;  \n&gt;Chap 5: Hard 5-2 (Junko, Glove, Watch Tier 1) &gt; Hard 5-1 (Akari, Shoe) &gt; Hard 5-3 (Hifumi, Hat)  \n&gt;  \n&gt;Chap 6: Hard 6-2 (Pina) &gt; Hard 6-3 (Junko) &gt; Hard 6-1 (Millennium EX book)  \n&gt;  \n&gt;Chap 7: Hard 7-3 (Hoshino, Hat Tier 2) &gt; Hard 7-2 (Serika, Glove, Watch Tier 2) &gt; Hard 7-1 (Asuna, Shoe Tier 2)  \n&gt;  \n&gt;Chap 8: Hard 8-3 (Haruna, Hat Tier 2) &gt; Hard 8-2 (Glove, Watch Tier 2) &gt; Hard 8-1 (Asuna, Shoe Tier 2)  \n&gt;  \n&gt;\\- If you have leftover stamina, already level 2 Red teams EXP to max, and cleared all daily Hard map, start farming equipment stages. Prioritize equipment for tank first, then dps striker, then buff support, then finally healer.  \n&gt;  \n&gt;\\- If you have enough equipment also, just start farming maps with EX books that your team need, with Dps Striker first priority, until you're out of stamina.  \n&gt;  \n&gt;\\-&gt; Repeat for next day.  \n&gt;  \n&gt;\\- If Sushiman map is open: try and do it. They drop Skill-related Materials, limit two per day each map. Student that belongs to school related to that map will get stat boost, but Sushiman will always be Red armor. Some school doesn't have enough student, so most the time you just have to settle with not having full bonuses.  \n&gt;  \n&gt;\\- ~~If PvP is open: RUSH IT.~~ (Don't rush PvP. They use the recent rework version of JP where you are placed against more players, less bots, and a lot less rewards. It's really sad.)  \n&gt;  \n&gt;\\- With Coin from PvP, you can use it in daily refresh shop. Priority list is: Stamina &gt; EXP (they all have same conversion rate, so dont worry which one to get) &gt; Character Shards. Priority of shards based on current JP shop: Mashiro &gt; Fuuka &gt; Saya &gt; Utaha. Only Mashiro you want to 5-star, the rest you can leave after getting them to 3-star, unless happen to be your waifu. Subject to change if Nexon give different characters.  \n&gt;  \n&gt;\\- If Raid is out for some reason: try it in practice mode, and if confident enough try clearing it. Careful not to forget to spend tickets as you were hesitating to save it for higher difficulty clear. Just finish every other thing you can do for dailies, and then come to raid with team you built up to that point and try your best.  \n&gt;  \n&gt;\\- With Coin from Raid, you can use it in Raid Shop that refresh every time new raid appears. Prioritize character shards &gt; EX book &gt; normal skill book. Character shards priority based on current JP list: Kotama &gt; Maki &gt; Hanae &gt; Akane &gt; Chinatsu. Except Kotama, Maki and Hanae, buy only enough 3-star them, unless waifu. Like PvP shop, subject to change based on Nexon. After clearing all the shards you need, start buying EX books and normal books want.\n\nBelow will be long and more in-depth guides. You can come back to it once you tried out more of game mechanics yourself.\n\n* **Fundamentals:**\n\nCurrently there are 4 types of attack, with 3 types of armor. (There's one more attack and armor type - Purple - but the game seems to hasn't introduced it yet). Each character will have one of these types of attack and armor and It works like rock-paper-scissor.\n\n\\-Normal Attack: PvE bots main type. Not weak against any armor type, but also not strong against any.\n\n\\-Red Attack: Strong against Red armor, weak against Blue, normal against Yellow Armor.\n\n\\-Yellow Attack: Strong against Yellow armor, weak against Red, normal against Blue Armor.\n\n\\-Blue Attack: Strong against Blue armor, weak against Yellow, normal against Red Armor.\n\n\\*As a note, just because the character has a strong attack vs a type, doesn't necessarily mean will always do more damage. Your Red Attack tank, or Red Attack healer will do less than your Blue Attack DPS against Red Armor. Type matching is still important, but Don't just mindlessly level them based on armor and attack without understanding their combat role first.\\*\n\nCharacter will be divided into Special and Striker categories. Striker = on-field combat, and Special is off-field. Despite being off-field, Special still has all the stats like Defense and HP, because \\*supposedly\\* the entire team share a portion of that stats (5% for atk def, 10% hp and healing power or so).\n\nThere's a confusion with Healing stats between different translation at the moment, but there is different stats for incoming heal and outgoing heal. You can search up indepth guide after game is released but know that it's there.\n\nJust like Girls' Frontline, some characters has better range and when put in team will increase team engagement range.\n\nThere are 3 types of environments: Indoor, Outdoor and Urban. A character engagement in fights (like likeliness to take cover and avoid shooting) and stats will be affected whether they like or dislike that environment which you can guess from the happy green face icon, yellow face neutral or red dislike face.\n\n* **Main Game + Currency:**\n\n\\&gt;You have Normal map and Hard map that you can farm for EX Book, Normal Skill Book, Materials, Character Shards, and Equipment. Materials and EXP and Gold will drop randomly even when you don't see them on the map listed drops. Higher maps also drop lower level books, material, and equipment tier randomly. These maps will resume when the game is exit and reenter, but you cannot return to menu in middle of a run.\n\nAt night map in Hard you also have hidden box at somewhere in map that reward 50 pyroxene when collected (but require map completion to be counted as collected).\n\n\\&gt;Story Mode:  Where you can read Main and Side characters stories. Sometimes required to progress main Campaign chapter.\n\n\\&gt;Daily Sushiman map gives skill-related materials, limit at 2 but extra tickets can be bought at shop to increase limit. Droprate sucks so not recommend using Pyroxene just to farm it.\n\n\\&gt;EXP and Gold Map give, well, EXP and Gold. High stamina cost, so not recommend to farm unless on rate-up event. And Gold is VERY ABUNDANCE.\n\n\\&gt;Raid map is endgame raid that rotates between several main raids: Kaiten, Hieronumus are Red attack raid, Chesed, Binah as Yellow raid, and ShiroKuro, Peperozilla (lastest) as Blue raid. There's a practice mode that you can run without any consequences (and good way to test trial a character) and the normal mode that cost daily ticket.\n\nYou can use any and all the characters to clear it, as after one team is either all down or run out of time, you can bring in another team to keep fighting it, with no limit to how many teams you can throw into a raid (if you run out of 4 team slot, just swap the character out with another char that hasn't enter the raid).\n\nRaid boss can have several phases (usually 2), and some team can excel better at one phase than the other. Usually, it's designed to be cleared with 1 or 2 teams, after which you usually run out of char with the right attack type or good team buff to clear it effectively. Some boss like Hieronumus has special gimmicks that can oneshot your team, so look into it before trying out the raid.\n\nWith level cap team and right characters you can mostly clear Hardcore (semi-last difficulty), but Extreme has pretty steep requirement of fully invested team(s). But Extreme will probably be added later after people has enough time to start leveling and participating.\n\nBut tbh, some types like Blue raid only has a handful of characters that you can realistically use to clear it, so it's can be pretty irritating if you happen to get too much of one character attack type from gacha and not enough others to form a good team. And the currency that drop from raid is used in the raid shop, that has A LOT OF goodies, so you either keep rerolling for raid char Hibiki Koharu or keep trying to get character shards in Hard map for Haruna, Iori, and Shiroko (I personally didn't have a problem as f2p in JP server since I got rarely get dupes, so the teams are pretty diverse. But I have seen people with worse lucks, and who knows what Nexon will do to the droprate.)\n\n\\&gt;PvP will unlock after certain level. A very big disclaimer: Try not to get too invested into it, it's pure RNG.\n\nYou pick a team to defend, and a team to attack other people. You can set up the team for positioning, but ***Skill activation will be auto-RNG***, and the only thing you can really do in-combat is speeding up or slowing down the fight. This mean you can have one very well-built team and lose out to someone way below your class because your healer decide to heal you max hp tank or their team crowd-control at perfect time and cancel your skill.\n\nYou get pyroxene when you reach every new rank for the first time, and there's no benefit to sandbagging because you will get that amount of pyroxene by getting at that rank either fast or slow.\n\nThis first time pyroxene is A LOT and can probably guaranteed a pity on banner, but on JP it ever only reset rank once or twice, so don't count on having that freebies income regularly.\n\nOther than that, you also get small amount of daily Pyroxene and PvP coin for maintaining your rank. These PvP coin is used in PvP shop for stamina pills, EXP and character shards (fixed characters, doesn't rotate). and On JP server, at first few ranks, there will be bot teams that help boosting your account a bit. Then you generally will be stuck at Gold or Silver. The difference of daily Pyroxene and PvP coin at higher rank is really not that much, so don't bawl your sanity out if your team f up, because ***Skill activation will be auto-RNG***. And btw, have I told you, ***Skill activation will be auto-RNG***? It is what it is.\n\n\\&gt;Crafting. You use a specific craft currency to craft, and each time you get five random nodes that give five options to craft. The minimum requirement to craft something is filling up the outer ring, but you can get put more to fill inner ring to get higher material. The more rare a material is, the longer crafting time (can go from 30 mins to 6h). You can get most of the stuffs for building your characters, but only Furniture and Gifts can be obtained from crafting. Furniture for your Dorm, Gift for your character Trust. You can get exclusive Furniture related to some event, and you can still get them after event is over. You can put more material to crafting to get guaranteed high tier materials, but just don't do it. If Nexon maintain the same rate as JP, you can put max into crafting and still can't get yellow guaranteed node. Generally just craft one per day for daily, and don't worry too much about it.\n\n\\&gt;Trust Chat: When characters increase Trust, their stats will increase, and after a certain rank you can chat with them to initiate a short story that unlock their Live2D art for main menu. Most characters have L2D arts.\n\n\\&gt;Circle Chat: Chatting in a group of 30 people. This circle is also people you can borrow units to be used in raids and you can also put your unit up for others, and you will get a little reward when they use it. You get 10 stamina per day for a message chat of anything, which will be sent over mail.\n\n\\&gt;Team Setup accessed from main menu is mostly for Campaign. In Raid, Event, and PvP, Sushimap, Exp... yeah BASICALLY everything else, they have their own setup. Even Event team setup will be remembered the next time another event is available, which actually is pretty handy.\n\n\\&gt;School Scheduling: To increase Trust with char, with a very low chance to get bonus Skill books or Character shards. First two zones drop random Skill books from any school, but further down will be zone specific for each school, even though sometimes the character that appear for Trust doesn't even come from that school (logic is whatever right). Basically just level your Waifu Trust mainly through here.\n\n\\&gt;Dorm: A little too basic tbh. More furniture = Higher rating = ***More Stamina you get per hour, which actually will be your major source of Stamina aside from normal regen***. To upgrade Dorm get material from clearing certain Campaign maps first time. Students will come randomly that you can click to increase Trust. Can't interact with them more than that, and they don't interact with most of the basic objects. About once a day can recruit one student of choice to increase Trust. Dorm size won't increase until later updates.\n\n* **In-combat:**\n\nCharacter positioning is affected by their categories: Front, Middle and Back (you can guess which one go where from those name). They will *always* try their best to position according to that, making them sometimes run around like headless chicken if they're trying to find cover that's might conflict with their positioning. Putting Front and Back in a team does not give more distance gap than Front/Middle or Middle/Back (at least not perceivable gap).\n\nYou get 3 EX skill slot for 6 max characters you can put in a team. More characters in the team increase EX skills recovery rate. The order of EX skills and which one appears first seems entirely random. You can save 1 or 2 slots with heal skill and tank skill so that you can keep final slot rotating attack skills. Prioritize char with less than 4 skill cost and AOE for more consistent clear.\n\n* **Buildings:**\n\nEach characters has few things to level:\n\n\\-Main level EXP:\n\n\\+Can only go as high as Level of your Sensei. Best way to increase your strength, as the stats boost is significant all the way to when you reach level cap.\n\nFarmable through: EXP domain (Not Recommended because stamina cost is Massive and not much in return, unless there is 2x drop event), PvP daily refresh shop (Recommended), Events (Highly Recommended), Crafting (Not recommended because of material cost)\n\n\\-Skill:\n\n\\+There are 1 EX skill that is the active skill and 3 normal skills that work like passive and auto-activated skills.\n\n\\+EX skill max at level 5, 3 normal skills max at level 10 that require a special book at end level.\n\n\\+EX skill use EX book and specific materials. Normal skill use normal book and specific material that is same as EX skill requirement.\n\n\\+EX skill upgrades make the biggest difference, but material drop-rate is abysmally horrendous. Normal skill has very little stats increased, but you will feel it when you level them sufficiently.\n\n\\+When you finally able to play raid, use raid points to buy your needed skill book, because other methods are all bad RNG.\n\nEX skill book and normal skill book Farmable through: Normal and Hard Campaign map (not recommended because of low drop, unless you need character shards at Hard map or there is 2x drop event), Raid shop (highly recommended, refresh every raid), daily Sushiman map (highly recommended, but you'll farm it for daily anyway) and Event (Highly Recommended, but some event only limit to one type of book related to the main school so you might not get what you need. But usually very cost effective, so just get them as much as you can to use for later.)\n\nSpecial material Farmable through: daily Sushiman map (highly recommended, as daily), Events (recommended, but there are events that drop so much material from just event farming that you might not even need to get them from event shop.)\n\n\\-Equipment:\n\n\\+Decent stat boost, can farm them while also farming for character shards in Hard map.\n\n\\+3 equipment slots per char that mostly depends on the character gun type.\n\n\\+Upgradable to Tier 6 (likely on global launch only limit to Tier 4 or 5 until further campaign chapter update).\n\n\\+At every Tier upgrade, require equipment piece of higher tier as material. At high tier also require both high and low tier equipment piece to ascend Tier.\n\n\\+At Tier 4, get secondary main stat that usually are very good.\n\nEquipment Farmable through: Normal and Hard map (Highly recommended, because it's the only way to get them kek). NEVER DROP FROM EVENT UP TO THIS POINT.\n\nEquipment EXP Orbs Farmable through: Yeah you gonna get a f load of it and will run out other resources before ever running out orbs. But in case you need them, get them in events.\n\n\\-Character Shards:\n\n\\+To ascend characters to higher tier, and in-case you don't have the character, can also unlock them (usually at 120 shard cost). Stat boost is very good after hitting level cap, but some characters benefits a lot more from unlocking extra skills when upgrading to 3-star. Hard map is the best way to reliably unlock and upgrade great units like Haruna (Hard Map 8 and 12), Iori (Hard Map 14), Shiroko (Hard Map 3 and 9). See Character priority below to know which to pick.\n\n\\+In gacha shop, you exchange gacha shards for shards of your specific char. It exchanges at cost of 1:1 at limit of 20, after which it will increasingly cost more gacha shards to exchange, exp 2:1 for another 20 shards, then 3:1, and cap at 5:1 at which point it stays at 5:1 with no more limit.\n\n\\+Gacha Shards Farmable through: Gacha. No other way.\n\n\\+Character Shards Farmable through: Gacha Shop (has to gacha to get gacha shards to exchange for specific char shards. 1-star dupe drop 1 shard, 2-star 10 shards, 3-star i think 100 shards but I almost never get dupe so not sure. Also only recently in JP server they have character shards drop directly when you get dupes alongside with gacha shards, which not sure will be at global yet on launch, so watch out for that if you wanna save shards), Raid shop (Fixed characters, but refresh every new raid. Contain many good characters, but will see if they will be the same for global), PvP shop (Fixed characters, refresh daily, will add more characters, but does not remove or replace current), Event (hippity hoppity just get all them properties).\n\n\\-Character Weapons: newest update in JP. Require your students to be at 5-star before start upgrading weapons. Very endgame and not relevant to global for now.\n\n* **Now the part you trying to look for: Characters Priority**\n\nAs with any other gacha, **Waifu&gt;Meta.** Your well-invested characters will clear Campaign and do well in Events. But it would be better if your waifu of choice is 2-star or more, because even though you can star-up low star characters, they are big investment costs and generally not as good at end upgrade as pure 3-star. But there are some 2-star that are irreplaceable in any content. ~~Generally, imho, just get yourself a team to clear at least some of any raid, clear campaign, and for your waifu just try level up their Trust and unlock their L2D for main screen. Don't really have to force them in team~~ just play however you want, because at the end of the day is all about seeing your favorites getting better and stronger. ~~Even if your favorite is a fridge.~~\n\nThe game is pretty demanding for character requirements because of the 3-attack-types system. You basically want one or two strong team of each attack type for endgame raids that rotates every few weeks. PvP is, as said, purely RNG, so just build enough to survive, but not over-invest at the cost of everything else. It's not worth it.\n\n***\\*General Raids***: These are chars that are universally good in any raid\n\n\\-Koharu: Heal me, you and everyone else you put on your team. Low cost AOE heal with auto-heal that most of the time by herself out-heal the raid damage. And even the heal bomb itself can do a little damage.\n\n\\-Iori: Best DPS. Low cost Skill also versatile dealing with both mobs and boss. Despite being Yellowm excel even in Blue Raids.\n\n\\-Tsubaki: THE tank. Not used in top team raid, but if you want to punch above your level, you need her to tank. Your team can probably clear the raid before she even go down, because of her 1-time heal burst at low HP (although some raid has high accuracy that can ruin the day, because her evasion and Hp is through the roof, but Defense stat is pretty sad). Can taunt Kaiten sushiman boss to cancel their skill.\n\n\\-Yuuka: THE tank no.2. Very well-round, with low cost shield. Slightly less tanky than Tsubaki, but if shield is maintained, can last longer.\n\n\\-Akane: Debuffer. Her 30% def down EX skill don't need investment, just put her in team for others to shine.\n\n\\-Cherino: Increase Cost Regen and AoE is great in Chesed Raid.\n\n\\-Kotama: Buffer, with a little debuffer. Basically built to be used for raids, and any top team will use her. Needs to be star-up for team passive extra buff.\n\n\\-Hibiki: Crit Dmg Buffer. AoE skill is versatile and is used, along Kotama, in all raids. Also can be used in PvP to hit backline.\n\n\\-Serina: Heal cost 2. Can drag an ally to a specific spot. Passive heal every 35s. Stand with Hanae as the best and most utilized healers.\n\n\\-Hanae: Heal overtime. Cost 4 but can out-heal almost any source of damage that doesn't one-hit. Has Crit Dmg team buffer like Hibiki. Hang with Serina at Special healer top.\n\n\\-Fuuka: Big AoE Heal that can reposition your team in some raids. Will heal your soul.\n\nUnits to be added later: Natsu (~~Laffey as~~ a tank that can cleanse and self-heal), Bunny Neru (Yuuka 2.0, but can jump ahead to do AOE damage. Less tanky, but more benefits) Saya Casual (Hibiki, but Yellow).\n\n***\\*Blue Raids***: Currently has ShiroKuro that's Single-Target (ST) oriented, and Perorozilla that requires heavy AOE.\n\n\\-For ShiroKuro, best on launch are Haruna, Izuna, Iori, and later on Swimsuit Azusa. Chise and Asuna also works well, but need much much investment. Strong Yellow Striker can also be used here.\n\n\\-Perorozilla is newest raid on JP, so dont need worry yet. But Natsu, Bunny Karin and Bunny Asuna will be used there.\n\n\\*Red Raids: Hieronymus (ST, but some AOE can work because chonky boss) and Kaiten (AOE phase 1, ST phase 2).\n\n\\-Kaiten: 5 sushi map at phase 1, 1 big boss phase 2. Just throw your favorite Red DPS to make it work. But on launch, Mutsuki, Shun, Shiroko, Azusa work best, with Bunny Neru and Swimsuit Iori be added later. But really, this is the raid that you can use any Red Striker and it will be fine.\n\n\\-Hieronymus: Has a gimmicks that requires you to keep healing lanterns to avoid one-shotting and do extra dmg. So Koharu is almost a must, with Serina and Hanae, and any healer you gonna need. Otherwise, DPS are the same as Kaiten.\n\n***\\*Yellow Raids:*** Chesed (AoE) and Binah (ST)\n\n\\-Chesed: Cherino, Iori, Midori, Nonomi, Momoi, Tsurugi, and Karin. Hifumi seems good, but deceptively bad, because her AoE attack isn't good enough to cover for the dmg lost of her ST potential. Nonomi has bad ST but her AoE is more than enough. Later on has Casual Saya that works best here.\n\n\\-Binah: Haven't personally played, but heard that Akane, Maki, Iori and Pina is top team. Karin is also used.\n\n***\\*PvP:*** If you've ignore all the warning about PvP ***Skill activation will be auto-RNG***, then here are the top PvP char\n\n\\-Shun: The unstoppable force. Free initial cost for a strong start, and if activated, will start wiping your backline. Made to be used in PvP, but can be countered with right team, and being luckier if your Shun activate first.\n\n\\-Haruna: War effort against Tsubaki. Can't backline like Shun but if lucky, her shot will line up and hit both front and back.\n\n\\-Iori: Your best bet. Positioning can expose her sometimes, especially in Shun-Haruna-Iori team comp, but will deal with everything you want to be dealt. Her skill can also hit backline if lucky.\n\n\\-Tsubaki: The immovable wall. If you dont have enough accuracy requirement, she will continue to live long after everyone already dead. If lucky her skill will cancel the other team's skill activation.\n\n\\-Yuuka: Tsubaki besties, since you need your team to have at least 2 tanks, because even as 1 front 3 back formation, one of them will always move a little forward and get hit. If you know what you doing, 3 DPS can work, just might not be as consistent.\n\n\\-Hibiki: As defending team, their Hibiki has a certain range that can actually hit both front and back. Meaning sometimes Shun and likes can also be wipe out this way. Solid in Raid, solid in PvP.\n\n\\-Serina and Hanae: works for the same reason they do in raids.\n\n\\-Mashiro: Has accuracy team buff that can help your team in the fight against raid boss Tsubaki.\n\n\\-Beach Mashiro: added in Summer event. Will invalidate your Tsubaki by one-shooting her. Coupled with Mashiro will clear all your tankers.\n\n\\-Bunny Neru: added in Bunny event. B.Neru is less tanky than Yuuka but it's nice to have someone bum-rush their team for the unexpected element.\n\nOf the Big 4 Special, only Kotama isn't used, cause you generally want your team to have as many skill-shots out as possible. A little bit of damage increase doesn't do much when everyone is getting assassinated.\n\nThere are also teams that can be built to counter each of these specific characters. After all it's PvP, everything is strong or weak against something. And in that something, you have this luck-based mechanics that you don't really know if your team will do what you intend for them to do.\n\nGenerally, just take it easy. Like someone said around here, it's only intend as a side game. Just do what you want, and in the end you rarely ever regret it.\n\n&amp;#x200B;\n\n[(credit to Xara on BA Discord)](https://preview.redd.it/pm0f3m25c7z71.png?width=1495&amp;format=png&amp;auto=webp&amp;s=78d71aac6a80b2163c658978c2adc0e781c1844f)\n\n* **Event Expectation**\n\nSadly, can't speak for the launch, as I wasn't in the game until June. But from June to now November, events are released consistently. Generally, you farm and get drops in event stages to exchange in shop. You get more drops per run if you use characters that they rate them up, either because they're in the current banner or related to current event stories. It feels a little P2W and I'm sure Nexon will exploit this. But you can clear shop as long as you keep farming high stage event map. The newer events though have an extra gacha event shop, which give a lot of high level goods, so any extra drops you get in stage is another opportunities for you to keep rolling that gacha event shop (for Bunny event, you get Neru and Karin shards, and in my personally case, was even enough to 5-star them from 3).\n\nAbout gacha banners, a very big note first and foremost is that **event characters banners can be separated into parts, like in Summer event you have Swimsuit Azusa releasing first and Swimsuit Hifumi releasing later. And there can also be different version of same event, like Trinity version of Summer event and Gehenna version, with Gehenna adding Swimsuit Hina and Swimsuit Iori banner**. So if you think summer event was already over with main event over, you might be surprised that there is another summer event releasing right after.\n\nThere are barely any rerun banners, as almost every banner is a new character, or limited characters. Limited are usually alternate version of existing characters, with all new everything from skill, attack and shield type, to extra live2d and quotes - all of which of you have to build from level 1. Alternate characters aren't necessary always limited, like Bike Shiroko and Casual Saya, but Limited characters are just released way too often. There's also another thing with droprate of this game: You can go 20 and get 3-star, or you can go 180 and not even getting it. The range it's vary is way to unpredictable, so unless you want to hit pity, which in f2p you can reach every a month or so, skipping at least several banners. The best is just go look at JP release schedule and start planning ahead for the one you actually want. Or, you can just go pull all you can every banner in hope of something, because as I played it, I was able to obtained almost every Limited banner without reaching pity, except Bunny Karin. And it always like I either get new 3-star every 35 wishes or so, or i can go more than 150 without encountering one. I got pretty lucky with my account, but i know it can and will be a problem for many people. One of my friend did quit because of this inconsistency.\n\nRate-up characters are also released alongside with a raid they're strong against. But don't ever take this as a note that you have to get them. Power-creeping has been a slight problem, but not to the point that your current characters suddenly become useless. There are strong limited char also, but unless you play for meta, just aim for the one you want.\n\nAs a minor thing, Mx2j arts, which has quite a majority in the game, seems to improve overtime. At first, their arts really clash with the rest of Blue Archive vibe, but later release seems to be much better, for example comparing Iori normal and Summer Iori. The biggest case for this is the Bunny series, which are all drawn by Mx2j, and looks nothing like their original arts. This was one of my main gripe back then, but now I can say that It's no long a problem.\n\n* **Final Note**\n\nMy impression was that Blue Archive is pretty much as a game just was an afterthought to the 'Hey I make this really cool concept of gun girl with clean future vibe and Future Bass blasting on background. Let's make it a game about that.' It is polished, well-thought, and quality improved overtime, but there are many shady mechanics that can be exacerbated by the game now also being in Nexon hands. Many people are drawn by that 'otherworldly utopic' vibe of the game, but there is a reminder that the best you can hope for this game is only all that you can hope. They can make it great, and slowly start cash cowing it a year later, shutting down shortly after with NAT Game taking back the license, and the only thing you can tell yourself is that you've been had. Always look out for the red flags, because history always spare some space for a story of a lesson learnt too late. Either way, that would be spoilsport for now. All the little things, if there will be any, will reveal itself in due time.\n\nHave fun with Blue Archive. I'll be joining soon.\n\n@ DyXie#8028 on Discord if you want to chat sometimes.\n\nEDIT: Wow my first ever 1k vote post. Thank you all so much for the rewards and the time you spent reading this long ass guide.","link":"https://www.reddit.com/r/BlueArchive/comments/qpd45c/a_dumbshits_guide_to_blue_archive/","name":"t3_qpd45c","ups":1970,"author":"ClarenceLe","created":"2021-11-08T13:00:11.000Z"},{"kind":"t3","subreddit":"BlueArchive","title":"Another PVP meme...","body":"","link":"https://www.reddit.com/r/BlueArchive/comments/rqgads/another_pvp_meme/","name":"t3_rqgads","ups":350,"author":"KohiiCat","created":"2021-12-28T13:48:54.000Z"},{"kind":"t3","subreddit":"Superstonk","title":"DEAR PEOPLE OF ALL, WE ARE SCREAMING AT YOU.","body":"","link":"https://www.reddit.com/r/Superstonk/comments/qi4zgc/dear_people_of_all_we_are_screaming_at_you/","name":"t3_qi4zgc","ups":42752,"author":"NostraSkolMus","created":"2021-10-29T04:49:33.000Z"}]}